glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_commands.c
    // 3. Reset peripheral.
    ADC->CTRLA.bit.SWRST = 1;
    while (ADC->STATUS.bit.SYNCBUSY) { /* spin */ }
    while (ADC->CTRLA.bit.SWRST)     { /* spin */ }

    // 4. Load factory calibration (NVMCTRL software-cal row) — required by
    //    datasheet 33.6.6. Without this the ADC has significant offset.
    uint32_t bias = (*((uint32_t*)ADC_FUSES_BIASCAL_ADDR) & ADC_FUSES_BIASCAL_Msk) >> ADC_FUSES_BIASCAL_Pos;
    uint32_t linearity = (*((uint32_t*)ADC_FUSES_LINEARITY_0_ADDR) & ADC_FUSES_LINEARITY_0_Msk) >> ADC_FUSES_LINEARITY_0_Pos;
    linearity |= ((*((uint32_t*)ADC_FUSES_LINEARITY_1_ADDR) & ADC_FUSES_LINEARITY_1_Msk) >> ADC_FUSES_LINEARITY_1_Pos) << 5;
    ADC->CALIB.reg = ADC_CALIB_BIAS_CAL(bias) | ADC_CALIB_LINEARITY_CAL(linearity);

    // 5. Reference INTVCC1 (= VDDANA/2). Combined with GAIN=DIV2 below, gives
    //    effective full-scale input = VDDANA (≈ 3.3 V).
    ADC->REFCTRL.reg = ADC_REFCTRL_REFSEL_INTVCC1;

    // 6. Sample rate / averaging — default single sample.
    ADC->AVGCTRL.reg = ADC_AVGCTRL_SAMPLENUM_1 | ADC_AVGCTRL_ADJRES(0);
    ADC->SAMPCTRL.reg = 0x05;   // default 5 ADC clock cycles sample time
                                // (overridden per-call by adc_apply_avg_hold)

    // 7. CTRLB: prescaler /256 → 48 MHz / 256 ≈ 187.5 kHz ADC clock, 12-bit
    //    single-conversion. /256 doubles per-sample throughput vs the historical
    //    /512 default while staying well below the 2.1 MHz max ADC clock.
    //    RESSEL toggled to 16BIT per-call when oversample > 0.
    ADC->CTRLB.reg = ADC_CTRLB_PRESCALER_DIV256 | ADC_CTRLB_RESSEL_12BIT;
    while (ADC->STATUS.bit.SYNCBUSY) { /* spin */ }

    // 8. INPUTCTRL: GAIN=DIV2, MUXNEG=GND (single-ended), MUXPOS set per-read.
    ADC->INPUTCTRL.reg = ADC_INPUTCTRL_GAIN_DIV2 | ADC_INPUTCTRL_MUXNEG_GND;
    while (ADC->STATUS.bit.SYNCBUSY) { /* spin */ }

    // 9. Enable.
    ADC->CTRLA.bit.ENABLE = 1;
    while (ADC->STATUS.bit.SYNCBUSY) { /* spin */ }

    // 10. Throw away the first conversion (per datasheet — first sample after
    //     enable is unreliable). MUXPOS=0 is fine for this dummy.
    ADC->SWTRIG.bit.START = 1;
    while (!ADC->INTFLAG.bit.RESRDY) { /* spin */ }
    (void)ADC->RESULT.reg;
    ADC->INTFLAG.reg = ADC_INTFLAG_RESRDY;

    g_adc_initialized = true;
}

// Configure the pin associated with an AIN channel to analog (PMUX function B).
// Caller supplies the chip (port, pin) coordinates of the pad.
static void adc_pin_config(uint8_t port, uint8_t pin) {
    PORT->Group[port].PINCFG[pin].bit.PMUXEN = 1;
    if (pin & 1u) {
        PORT->Group[port].PMUX[pin / 2u].bit.PMUXO = PORT_PMUX_PMUXO_B_Val;
    } else {
        PORT->Group[port].PMUX[pin / 2u].bit.PMUXE = PORT_PMUX_PMUXE_B_Val;
    }
}

// Translate an AIN[ch] index back to the (port, pin) of its pad. Used to
// configure the pin's PMUX before sampling. Covers channels 0..19 on
// SAMD21G18A; entries outside the package map are {0xFF, 0xFF} (unused).
typedef struct { uint8_t port; uint8_t pin; } ain_to_pad_t;
static const ain_to_pad_t g_ain_to_pad[20] = {
    [0]  = {0,  2}, [1]  = {0,  3}, [2]  = {1,  8}, [3]  = {1,  9},
    [4]  = {0,  4}, [5]  = {0,  5}, [6]  = {0,  6}, [7]  = {0,  7},
    [8]  = {1,  0}, [9]  = {1,  1}, [10] = {1,  2}, [11] = {1,  3},
    [12] = {0, 10}, [13] = {0, 11}, [14] = {0, 12}, [15] = {0, 13},
    [16] = {0,  8}, [17] = {0,  9}, [18] = {0, 10}, [19] = {0, 11},
};

// ---- per-call ADC configuration (oversample + sample-hold) ---------------
// oversample_exp:   0..7 → SAMPLENUM = 2^N samples averaged (1, 2, 4, 8, 16, 32, 64, 128)
//                   Result is hardware-averaged to 12-bit equivalent (0..4095).
//
//                   ADJRES is set to min(oversample_exp, 4), NOT to oversample_exp
//                   directly. Empirical SAMD21 behaviour (bench-verified 2026-05-24):
//                   for SAMPLENUM > 4, the hardware pre-right-shifts each sample by
//                   (SAMPLENUM-4) bits to keep the accumulator in its fixed width,
//                   THEN applies ADJRES. So writing ADJRES=SAMPLENUM gives a result
//                   already further shifted by (SAMPLENUM-4), under-reporting the
//                   average by 2^(SAMPLENUM-4). Capping ADJRES at 4 unwinds that.
//                   Trade-off: SAMPLENUM > 4 loses (SAMPLENUM-4) low bits of each
//                   raw sample to the pre-shift — noise-reduction benefit caps at
//                   ~SAMPLENUM=16 in practice. Going to 32/64/128 still works but
//                   the marginal stddev improvement is small.
//
// sample_hold_cyc:  0..63 → SAMPCTRL.SAMPLEN. Time = (cyc + 1) ADC clocks.
//                   At /256 prescaler (5.33 µs/cycle): 5 µs..341 µs hold time.
//                   Pick 5..10 for low-impedance sources, 20+ for high-Z sensors
//                   (≥ 100 kΩ thermistors / photoresistors).
#define ADC_OVERSAMPLE_MAX  7u
#define ADC_SAMPLE_HOLD_MAX 63u

static uint8_t adc_apply_avg_hold(uint8_t oversample_exp, uint8_t sample_hold_cyc) {
    if (oversample_exp > ADC_OVERSAMPLE_MAX) return SHELL_STATUS_BAD_ARGS;
    if (sample_hold_cyc > ADC_SAMPLE_HOLD_MAX) return SHELL_STATUS_BAD_ARGS;

    uint8_t adjres = (oversample_exp <= 4u) ? oversample_exp : 4u;
    ADC->AVGCTRL.reg = ADC_AVGCTRL_SAMPLENUM(oversample_exp)
                     | ADC_AVGCTRL_ADJRES(adjres);
    ADC->SAMPCTRL.reg = sample_hold_cyc;

    // RESSEL: 12-bit single sample vs 16-bit averaging mode.
    uint32_t ctrlb = ADC->CTRLB.reg & ~ADC_CTRLB_RESSEL_Msk;
    ctrlb |= (oversample_exp == 0u) ? ADC_CTRLB_RESSEL_12BIT
                                    : ADC_CTRLB_RESSEL_16BIT;
    ADC->CTRLB.reg = (uint16_t)ctrlb;
    while (ADC->STATUS.bit.SYNCBUSY) { /* spin */ }
    return SHELL_STATUS_OK;
}

// Minimum per-sample wall-clock at /256 prescaler. One conversion takes
// (sample_hold_cyc + 7) ADC clocks (6 for 12-bit conv + 1 propagation +
// sample-hold). Multiplied by oversample count for averaging. 5333 ns/cycle
// (= 1e9 / 187500). Returns µs, rounded up.
static uint32_t adc_min_sample_period_us(uint8_t oversample_exp, uint8_t sample_hold_cyc) {
    uint32_t samples = 1u << oversample_exp;
    uint32_t cyc     = (uint32_t)sample_hold_cyc + 7u;
    uint32_t ns      = samples * cyc * 5333u;
    return (ns + 999u) / 1000u;
}

