glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_commands.c
// ---------- Public single-shot ADC reader ---------------------------------
// Exposed via samd21_adc.h for use by the interlock framework's adc_int
// input source. Mirrors the conversion path used by CMD_ADC_READ; callers
// are responsible for not interleaving with a long-running ADC capture.
uint16_t samd21_adc_read_oneshot(uint8_t channel,
                                 uint8_t oversample_exp,
                                 uint8_t sh_cyc) {
    if (channel > 19u) return 0;

    adc_init();
    (void)adc_apply_avg_hold(oversample_exp, sh_cyc);

    ain_to_pad_t pad = g_ain_to_pad[channel];
    if (pad.port != 0xFFu) {
        adc_pin_config(pad.port, pad.pin);
    }

    ADC->INPUTCTRL.bit.MUXPOS = channel;
    while (ADC->STATUS.bit.SYNCBUSY) { /* spin */ }
    ADC->INTFLAG.reg = ADC_INTFLAG_RESRDY;
    ADC->SWTRIG.bit.START = 1;
    while (!ADC->INTFLAG.bit.RESRDY) { /* spin */ }
    uint16_t value = (uint16_t)ADC->RESULT.reg;
    ADC->INTFLAG.reg = ADC_INTFLAG_RESRDY;
    return value;
}

// ---------- CMD_ADC_READ -------------------------------------------------
// args:   channel:u8 (AIN index, 0..19)
//         oversample_exp:u8  (0..7 → 1..128 samples averaged)
//         sample_hold_cyc:u8 (0..63 ADC clock cycles)
// result: value:u16 (12-bit equivalent, 0..4095; 4095 ≈ VDDANA ≈ 3.3 V)
// status: OK / BAD_ARGS

static uint8_t cmd_adc_read(shell_reader_t* args, shell_writer_t* result) {
    uint8_t channel         = sr_u8(args);
    uint8_t oversample_exp  = sr_u8(args);
    uint8_t sample_hold_cyc = sr_u8(args);
    if (args->overflow)                       return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)              return SHELL_STATUS_BAD_ARGS;
    if (channel > 19u)                        return SHELL_STATUS_BAD_ARGS;
    if (oversample_exp > ADC_OVERSAMPLE_MAX)  return SHELL_STATUS_BAD_ARGS;
    if (sample_hold_cyc > ADC_SAMPLE_HOLD_MAX) return SHELL_STATUS_BAD_ARGS;

    uint16_t value = samd21_adc_read_oneshot(channel, oversample_exp, sample_hold_cyc);
    sw_u16(result, value);
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// ---------- CMD_DAC_FOLLOW_START -----------------------------------------
// Bench mode: continuously sample one ADC input (hardware-averaged) and mirror
// it to the DAC (A0). Interrupt-driven (TC3); the ISR step is non-blocking.
// Mutually exclusive with the DAC waveform generator (shared TC3 + DAC).
//
// args:   oversample_exp:u8  (0..7  -> 1..128 samples averaged, like adc_read)
//         sample_hold_cyc:u8 (0..63)
//         update_hz:u16      (1..10000; 0 -> default 1000)
//         pin:str            (board label "A1".."A10" / "D1".."D10", trailing)
// result: empty
// status: OK / BAD_ARGS
//
// The input is a USER board label, validated against the pin table — A0 (DAC),
// D4/D5 (I2C), D6/D7 (UART) are RESERVED and rejected; the label must have ADC.
#define DAC_FOLLOW_HZ_MIN      1u
#define DAC_FOLLOW_HZ_MAX      10000u
#define DAC_FOLLOW_HZ_DEFAULT  1000u

static uint8_t cmd_dac_follow_start(shell_reader_t* args, shell_writer_t* result) {
    (void)result;
    uint8_t  oversample_exp  = sr_u8(args);
    uint8_t  sample_hold_cyc = sr_u8(args);
    uint16_t update_hz       = sr_u16(args);
    if (args->overflow)                           return SHELL_STATUS_BAD_ARGS;

    uint16_t label_len = sr_remaining(args);
    const char* label  = (const char*)args->p;        // trailing bytes = board label
    if (label_len == 0u || label_len > 3u)        return SHELL_STATUS_BAD_ARGS;
    if (oversample_exp > ADC_OVERSAMPLE_MAX)      return SHELL_STATUS_BAD_ARGS;
    if (sample_hold_cyc > ADC_SAMPLE_HOLD_MAX)    return SHELL_STATUS_BAD_ARGS;
    if (update_hz == 0u) update_hz = DAC_FOLLOW_HZ_DEFAULT;
    if (update_hz < DAC_FOLLOW_HZ_MIN || update_hz > DAC_FOLLOW_HZ_MAX) return SHELL_STATUS_BAD_ARGS;

    const board_pin_t* p = board_pin_lookup(label, (uint8_t)label_len);
    if (p == NULL)                                return SHELL_STATUS_BAD_ARGS;
    if (board_pin_is_reserved(p))                 return SHELL_STATUS_BAD_ARGS;  // A0/D4/D5/D6/D7
    if (!(p->caps & BOARD_PIN_CAP_ADC) || p->adc_channel == BOARD_PIN_ADC_NONE)
                                                  return SHELL_STATUS_BAD_ARGS;

    uint32_t period = 48000000u / (uint32_t)update_hz;
    if (period < 2u || period > 65535u)           return SHELL_STATUS_BAD_ARGS;

    dac_init();
    tc3_init_once();
    adc_init();
    (void)adc_apply_avg_hold(oversample_exp, sample_hold_cyc);

    // Configure the input pad + ADC mux ONCE; the ISR then free-runs conversions.
    ain_to_pad_t pad = g_ain_to_pad[p->adc_channel];
    if (pad.port != 0xFFu) adc_pin_config(pad.port, pad.pin);
    ADC->INPUTCTRL.bit.MUXPOS = p->adc_channel;
    while (ADC->STATUS.bit.SYNCBUSY) { /* spin */ }
    ADC->INTFLAG.reg = ADC_INTFLAG_RESRDY;
    ADC->SWTRIG.bit.START = 1;                    // kick the first conversion

    NVIC_DisableIRQ(TC3_IRQn);
    g_dac_wf.active          = false;             // mutual exclusion with waveform
    g_dac_follow.adc_channel = p->adc_channel;
    g_dac_follow.active      = true;
    tc3_start_at_period((uint16_t)period);        // re-enables the TC3 NVIC line
    return SHELL_STATUS_OK;
}

// ---------- CMD_DAC_FOLLOW_STOP ------------------------------------------
// args: empty   result: empty   status: OK   (DAC parks at its last value)
static uint8_t cmd_dac_follow_stop(shell_reader_t* args, shell_writer_t* result) {
    (void)result;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    g_dac_follow.active = false;
    tc3_stop();
    return SHELL_STATUS_OK;
}

// ---------- CMD_ADC_CAPTURE -----------------------------------------------
// Multi-channel buffered ADC capture.
//
// args:   num_channels:u8 (1..8)
//         channels:u8[num_channels] (each 0..19)
//         num_samples:u16 (per channel)
//         delta_time_us:u32 (≥ 1000; board_millis() timing, ms granularity)
//         oversample_exp:u8  (0..7 → 1..128 samples averaged per result)
//         sample_hold_cyc:u8 (0..63 ADC clock cycles)
// result: num_channels:u8 (echo)
//         num_samples:u16 (echo)
//         samples:u16[num_channels * num_samples]  (interleaved: sample0_ch0,
//                                                   sample0_ch1, ..., sample1_ch0, ...)
// status: OK / BAD_ARGS / RESULT_TOO_BIG
//
// delta_time_us must be ≥ adc_min_sample_period_us(oversample_exp, sample_hold_cyc)
// times num_channels — refused with BAD_ARGS otherwise so the captured samples
// don't silently smear.
//
// v1 cap: total samples (num_channels × num_samples) ≤ 60 to fit one OP_SHELL_REPLY
// frame (≤ 125 B result_message after the 3-byte shell wrapper). Larger captures
// will need chunked replies; deferred.

#define ADC_CAPTURE_MAX_CHANNELS  8u
#define ADC_CAPTURE_MAX_SAMPLES   60u   // total across all channels
#define ADC_CAPTURE_MIN_DELTA_US  1000u

static uint8_t cmd_adc_capture(shell_reader_t* args, shell_writer_t* result) {
    uint8_t num_channels = sr_u8(args);
    if (args->overflow) return SHELL_STATUS_BAD_ARGS;
    if (num_channels == 0u || num_channels > ADC_CAPTURE_MAX_CHANNELS) return SHELL_STATUS_BAD_ARGS;

    uint8_t channels[ADC_CAPTURE_MAX_CHANNELS];
    for (uint8_t i = 0; i < num_channels; i++) {
        channels[i] = sr_u8(args);
        if (args->overflow)        return SHELL_STATUS_BAD_ARGS;
        if (channels[i] > 19u)     return SHELL_STATUS_BAD_ARGS;
    }

    uint16_t num_samples    = sr_u16(args);
    uint32_t delta_time_us  = sr_u32(args);
    uint8_t  oversample_exp = sr_u8 (args);
    uint8_t  sample_hold    = sr_u8 (args);
    if (args->overflow)            return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)   return SHELL_STATUS_BAD_ARGS;
    if (num_samples == 0u)         return SHELL_STATUS_BAD_ARGS;
    if (delta_time_us < ADC_CAPTURE_MIN_DELTA_US) return SHELL_STATUS_BAD_ARGS;

    uint32_t total = (uint32_t)num_channels * (uint32_t)num_samples;
    if (total > ADC_CAPTURE_MAX_SAMPLES) return SHELL_STATUS_BAD_ARGS;

