glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_commands.c
    // Refuse delta_time_us that won't fit one full per-channel scan with the
    // requested oversample/sample-hold — prevents silently-smeared samples.
    uint32_t min_per_sample_us = adc_min_sample_period_us(oversample_exp, sample_hold);
    uint32_t min_slot_us       = min_per_sample_us * (uint32_t)num_channels;
    if (delta_time_us < min_slot_us) return SHELL_STATUS_BAD_ARGS;

    // Cold-path safety: cmd_adc_capture may be the first ADC op after boot
    // (e.g. waveform-capture-only workflows). g_adc_initialized is in zero-init
    // .bss, so without this the ADC has no clock/enable/calibration and the
    // inner spin loop hangs forever. No-op if already initialised.
    adc_init();

    uint8_t st = adc_apply_avg_hold(oversample_exp, sample_hold);
    if (st != SHELL_STATUS_OK) return st;

    // Pre-configure each channel's pad for analog mux.
    for (uint8_t i = 0; i < num_channels; i++) {
        ain_to_pad_t pad = g_ain_to_pad[channels[i]];
        if (pad.port != 0xFFu) {
            adc_pin_config(pad.port, pad.pin);
        }
    }

    uint32_t delta_ms = delta_time_us / 1000u;

    // Emit result header up front.
    sw_u8 (result, num_channels);
    sw_u16(result, num_samples);

    // Capture loop. Sample-slot timing: anchor on board_millis() at start of
    // each slot, sample all channels back-to-back, then sleep remaining time.
    for (uint16_t s = 0; s < num_samples; s++) {
        uint32_t slot_start_ms = board_millis();

        for (uint8_t c = 0; c < num_channels; c++) {
            ADC->INPUTCTRL.bit.MUXPOS = channels[c];
            while (ADC->STATUS.bit.SYNCBUSY) { /* spin */ }
            ADC->INTFLAG.reg = ADC_INTFLAG_RESRDY;
            ADC->SWTRIG.bit.START = 1;
            while (!ADC->INTFLAG.bit.RESRDY) { /* spin */ }
            uint16_t v = (uint16_t)ADC->RESULT.reg;
            ADC->INTFLAG.reg = ADC_INTFLAG_RESRDY;
            sw_u16(result, v);
            if (result->overflow) return SHELL_STATUS_RESULT_TOO_BIG;
        }

        if (s < num_samples - 1u) {
            while ((board_millis() - slot_start_ms) < delta_ms) { /* spin */ }
        }
    }

    return SHELL_STATUS_OK;
}

// ============================================================================
// I2C master — SERCOM2 on D4=PA08 (SDA) / D5=PA09 (SCL), 100 kHz.
//
// PMUX function D selects SERCOM2 PAD[0]/[1] on PA08/PA09. Statically
// initialised at boot via samd21_peripherals_init(); D4/D5 are reserved
// from GPIO commands by pin_is_reserved().
//
// Smart mode disabled; we drive CTRLB.CMD + ACKACT explicitly so error
// paths (NACK / bus error / arb lost) can issue STOP cleanly.
//
// BAUD = (f_GCLK / (2 × f_SCL)) - 5 = (48 MHz / 200 kHz) - 5 = 235.
// Rise time term ignored — acceptable for the slow-bus role.
//
// Polling-mode. Bus hangs are caught by layer-2 WDT (max ~4 s).
// ============================================================================

#define I2C_SERCOM           SERCOM2
#define I2C_GCLK_ID_CORE     SERCOM2_GCLK_ID_CORE
#define I2C_GCLK_ID_SLOW     SERCOM2_GCLK_ID_SLOW
#define I2C_BAUD_100K        235u

static void i2c_init(void) {
    // 1. Bus clock.
    PM->APBCMASK.reg |= PM_APBCMASK_SERCOM2;

    // 2. SERCOM2 core + slow clocks → GCLK0 (48 MHz).
    GCLK->CLKCTRL.reg = (uint16_t)(GCLK_CLKCTRL_ID(I2C_GCLK_ID_CORE)
                                 | GCLK_CLKCTRL_GEN_GCLK0
                                 | GCLK_CLKCTRL_CLKEN);
    while (GCLK->STATUS.bit.SYNCBUSY) { /* spin */ }
    GCLK->CLKCTRL.reg = (uint16_t)(GCLK_CLKCTRL_ID(I2C_GCLK_ID_SLOW)
                                 | GCLK_CLKCTRL_GEN_GCLK0
                                 | GCLK_CLKCTRL_CLKEN);
    while (GCLK->STATUS.bit.SYNCBUSY) { /* spin */ }

    // 3. Reset SERCOM2.
    I2C_SERCOM->I2CM.CTRLA.bit.SWRST = 1;
    while (I2C_SERCOM->I2CM.SYNCBUSY.bit.SWRST) { /* spin */ }

    // 4. Configure as I2C master, 300 ns SDA hold, smart mode OFF.
    I2C_SERCOM->I2CM.CTRLA.reg =
        SERCOM_I2CM_CTRLA_MODE_I2C_MASTER |
        SERCOM_I2CM_CTRLA_SDAHOLD(2);

    // 5. 100 kHz baud.
    I2C_SERCOM->I2CM.BAUD.reg = SERCOM_I2CM_BAUD_BAUD(I2C_BAUD_100K);

    // 6. PMUX PA08/PA09 → function D (SERCOM-ALT = SERCOM2 PAD[0]/[1]).
    PORT->Group[0].PINCFG[8].bit.PMUXEN = 1;
    PORT->Group[0].PMUX[4].bit.PMUXE    = PORT_PMUX_PMUXE_D_Val;  // PA08 even
    PORT->Group[0].PINCFG[9].bit.PMUXEN = 1;
    PORT->Group[0].PMUX[4].bit.PMUXO    = PORT_PMUX_PMUXO_D_Val;  // PA09 odd

    // 7. Enable.
    I2C_SERCOM->I2CM.CTRLA.bit.ENABLE = 1;
    while (I2C_SERCOM->I2CM.SYNCBUSY.bit.ENABLE) { /* spin */ }

    // 8. Force bus state to IDLE (1). On power-up the controller reports
    //    UNKNOWN (0) and refuses transactions until told the bus is idle.
    I2C_SERCOM->I2CM.STATUS.bit.BUSSTATE = 1;
    while (I2C_SERCOM->I2CM.SYNCBUSY.bit.SYSOP) { /* spin */ }
}

#ifdef I2C_CLIENT
// ============================================================================
// I2C CLIENT (slave) mode — SERCOM2 reconfigured as an I2C slave so the Pico
// I2C master can talk to this dongle. Same pins (PA08/PA09 = D4/D5), same GCLK0
// as the master path; -DI2C_CLIENT selects slave instead of master at boot.
//
// Register-mapped device (like a classic I2C chip): the master writes a register
// address (pointer), then reads/writes with auto-increment. SERCOM slave uses
// smart mode + SCLSM; the ISR loads the tx byte into DATA — and must pre-load the
// first byte on AMATCH(read) or the stale address byte clocks out first.
//
// M2a — control bank (always live, every mode):
//   0x00 WHO_AM_I(ro)=0x5A  0x01 VERSION(ro)  0x02 MODE(rw)  0x03 STATUS(ro)
//   0x04 INT_FLAGS(ro/W1C)  0x05 I2C_ADDR(ro)  0x06..0x0D UNIQUE_ID[8](ro)
// Mode switching is stubbed (stores MODE); per-mode config + the store window
// (0x40..) land in M2b/M2c.
// ============================================================================
#define I2C_CLIENT_WHOAMI       0x5Au
#define I2C_CLIENT_VERSION      0x01u
#define I2C_CLIENT_ADDR_DEFAULT 0x55u   // 7-bit; M2c makes this come from the store

