glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_commands.c
enum { MODE_IDLE = 0, MODE_PIO, MODE_ADC, MODE_MIXED, MODE_SERVO, MODE_COUNTER, MODE_MAX = MODE_COUNTER };

static volatile uint8_t i2c_reg_ptr;        // register address pointer
static volatile bool    i2c_reg_ptr_known;  // first write byte after addr = the pointer
static volatile uint8_t g_mode      = MODE_IDLE;
static volatile uint8_t g_status;           // bit0 flash-busy, bit1 store-err, bit2 int-pending
static volatile bool    g_offline = false;  // commissioning state: false=ONLINE, true=OFFLINE (STATUS bit3)
static volatile uint8_t g_int_flags;        // interlock trip flags (W1C)
static uint8_t          g_i2c_addr  = I2C_CLIENT_ADDR_DEFAULT;
static uint8_t          g_unique_id[8];

// SAMD21 factory serial: word0 @ 0x0080A00C, word1 @ 0x0080A040 (low 64 bits).
static void i2c_read_unique_id(void) {
    uint32_t w0 = *(const volatile uint32_t *)0x0080A00Cu;
    uint32_t w1 = *(const volatile uint32_t *)0x0080A040u;
    g_unique_id[0] = (uint8_t)w0;         g_unique_id[1] = (uint8_t)(w0 >> 8);
    g_unique_id[2] = (uint8_t)(w0 >> 16); g_unique_id[3] = (uint8_t)(w0 >> 24);
    g_unique_id[4] = (uint8_t)w1;         g_unique_id[5] = (uint8_t)(w1 >> 8);
    g_unique_id[6] = (uint8_t)(w1 >> 16); g_unique_id[7] = (uint8_t)(w1 >> 24);
}

// ---- M2b: log-structured, wear-leveled NAME-KEYED config store -------------
// 256 rows (64 KB) just below the commission A/B slots (0x3FE00). Each commit
// appends a 256-B entry to a round-robin NON-LIVE row; latest seq per NAME
// wins on read; CRC-8 guards torn writes (power-safe). RAM-shadowed into a
// fixed bank of slots (each slot = one 4-char name); the flash write (~ms) is
// deferred to the main loop (i2c_store_service) so the I2C ISR stays fast.
// Write-coalescing skips a commit whose bytes are unchanged. This is the
// foundation for a named-file config filesystem (4-char names).
extern uint8_t crc8_autosar_update(uint8_t crc, uint8_t byte);   // libcomm

#define STORE_ROWS        256u
#define STORE_ROW_SIZE    256u
#define STORE_PAGE_SIZE   64u
#define STORE_BASE        (0x3FE00u - STORE_ROWS * STORE_ROW_SIZE)  // 0x2FE00
#define STORE_ENTRY_MAGIC 0x10C0FFEEu
#define STORE_NAME_LEN    4u
#define STORE_DATA_MAX    240u
#define STORE_SLOTS       16u    // RAM-shadow cap: at most 16 distinct names live

// store-window register addresses
#define REG_REC_SEL    0x40u
#define REG_REC_LEN    0x41u
#define REG_REC_OFF    0x42u
#define REG_REC_DATA   0x43u
#define REG_REC_CTRL   0x44u
#define REG_STORE_STAT 0x45u
#define REG_SET_ADDR   0x0Fu   // control-bank: magic-guarded address commissioning (data-port)

// FILE bank (0x50..0x55) — name-keyed, read-only-for-master config-file access.
// Lives in the MAIN switch so it's available in every mode (the Pico reads
// config regardless of the active HIL mode). LIST enumerates; OPEN+SIZE+DATA
// reads a known file by name. File writing is the USB path (a later step).
#define REG_FILE_NAME  0x50u   // rw, data-port: burst the 4-byte name in/out
#define REG_FILE_CTRL  0x51u   // w: 1=OPEN 2=CLOSE 3=LIST_FIRST 4=LIST_NEXT
#define REG_FILE_STAT  0x52u   // r: 0=OK (open) 1=NOT_FOUND (closed)
#define REG_FILE_SIZE  0x53u   // r: open file length (≤240, u8)
#define REG_FILE_SEEK  0x54u   // w: set read cursor
#define REG_FILE_DATA  0x55u   // r, data-port: next file byte (0xFF past EOF)

// Registers the master bursts -> the ISR must NOT advance the register pointer.
#define IS_DATA_PORT(r) ((r) == REG_REC_DATA || (r) == REG_SET_ADDR \
                      || (r) == REG_FILE_NAME || (r) == REG_FILE_DATA)

typedef struct {
    uint32_t magic;                  // STORE_ENTRY_MAGIC
    uint32_t seq;                    // monotonic; highest per name wins
    uint8_t  name[STORE_NAME_LEN];   // 4-char key (space/zero padded)
    uint8_t  len;
    uint8_t  crc;                    // crc8_autosar(name[4], len, data[len])
    uint8_t  pad[2];
    uint8_t  data[STORE_DATA_MAX];
} store_entry_t;                     // 256 B = 1 flash row
_Static_assert(sizeof(store_entry_t) == 256, "store_entry_t must be exactly one 256-B flash row");

// Per-slot RAM shadow. A slot is in use once a name has been bound to it.
static uint8_t  g_rec_name[STORE_SLOTS][STORE_NAME_LEN]; // 4-char key
static bool     g_rec_used[STORE_SLOTS];                 // slot bound to a name
static uint8_t  g_rec_data[STORE_SLOTS][STORE_DATA_MAX]; // working / shadow copies
static uint8_t  g_rec_len[STORE_SLOTS];
static uint32_t g_rec_seq[STORE_SLOTS];                  // 0 = none committed
static int16_t  g_rec_row[STORE_SLOTS];                  // flash row of current entry, -1 none
static bool     g_rec_dirty[STORE_SLOTS];
static uint16_t g_store_wr_cursor;                       // round-robin write cursor
static volatile int8_t g_commit_pending = -1;            // slot index to commit (ISR -> main loop)
static volatile bool   g_reset_pending;                  // soft-reset request (ISR -> main loop)
static bool            g_setaddr_armed;                  // SET_ADDR magic seen, awaiting the new addr
static uint8_t  g_store_rec_sel;                         // selected SLOT index (0..STORE_SLOTS-1)
static uint8_t  g_store_rec_off;

// FILE bank state — name-keyed read-only access for the I2C master (Pico).
static uint8_t  g_file_name[STORE_NAME_LEN];             // burst-built name key
static uint8_t  g_file_name_idx;                         // 0..3, name burst cursor
static int      g_file_slot = -1;                        // open slot, -1 = closed/not-found
static uint8_t  g_file_off;                              // read cursor into the open file
static uint8_t  g_file_list_i;                           // LIST iterator cursor over slots

// NVM primitives (PAGE=64, ROW=256, ADDR = byte/2). Mirrors flash_storage.c.
static void cs_nvm_wait(void) { while (NVMCTRL->INTFLAG.bit.READY == 0) { /* spin */ } }
static void cs_nvm_erase_row(uint32_t addr) {
    cs_nvm_wait();
    NVMCTRL->ADDR.reg = addr / 2u;
    NVMCTRL->CTRLA.reg = NVMCTRL_CTRLA_CMD_ER | NVMCTRL_CTRLA_CMDEX_KEY;
    cs_nvm_wait();
}
static void cs_nvm_write_page(uint32_t addr, const void *data, uint32_t bytes) {
    cs_nvm_wait();
    NVMCTRL->CTRLA.reg = NVMCTRL_CTRLA_CMD_PBC | NVMCTRL_CTRLA_CMDEX_KEY;
    cs_nvm_wait();
    NVMCTRL->CTRLB.bit.MANW = 1;
    volatile uint32_t *dst = (volatile uint32_t *)(uintptr_t)addr;
    const uint8_t *src = (const uint8_t *)data;
    uint32_t words = (bytes + 3u) / 4u;
    if (words * 4u > STORE_PAGE_SIZE) words = STORE_PAGE_SIZE / 4u;
    for (uint32_t i = 0; i < words; i++) { uint32_t w; memcpy(&w, &src[i*4u], 4u); dst[i] = w; }
    NVMCTRL->ADDR.reg = addr / 2u;
    NVMCTRL->CTRLA.reg = NVMCTRL_CTRLA_CMD_WP | NVMCTRL_CTRLA_CMDEX_KEY;
    cs_nvm_wait();
}

static const store_entry_t *store_row(uint16_t row) {
    return (const store_entry_t *)(uintptr_t)(STORE_BASE + (uint32_t)row * STORE_ROW_SIZE);
}
static uint8_t store_crc(const uint8_t name[STORE_NAME_LEN], uint8_t len, const uint8_t *data) {
    uint8_t c = 0xFFu;
    for (uint8_t i = 0; i < STORE_NAME_LEN; i++) c = crc8_autosar_update(c, name[i]);
    c = crc8_autosar_update(c, len);
    for (uint8_t i = 0; i < len; i++) c = crc8_autosar_update(c, data[i]);
    return (uint8_t)(c ^ 0xFFu);
}
static bool store_entry_valid(const store_entry_t *e) {
    return e->magic == STORE_ENTRY_MAGIC && e->name[0] != 0xFFu && e->len <= STORE_DATA_MAX
        && store_crc(e->name, e->len, e->data) == e->crc;
}

