glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_commands.c
// Slot lookup: index of a USED slot whose name matches, else -1.
static int store_find(const uint8_t name[STORE_NAME_LEN]) {
    for (uint8_t i = 0; i < STORE_SLOTS; i++)
        if (g_rec_used[i] && memcmp(g_rec_name[i], name, STORE_NAME_LEN) == 0) return (int)i;
    return -1;
}
// Get the slot for `name`, allocating a free one if needed. -1 if the bank is full.
static int store_alloc(const uint8_t name[STORE_NAME_LEN]) {
    int s = store_find(name);
    if (s >= 0) return s;
    for (uint8_t i = 0; i < STORE_SLOTS; i++) {
        if (!g_rec_used[i]) {
            g_rec_used[i] = true;
            memcpy(g_rec_name[i], name, STORE_NAME_LEN);
            g_rec_len[i] = 0; g_rec_seq[i] = 0; g_rec_row[i] = -1; g_rec_dirty[i] = false;
            return (int)i;
        }
    }
    return -1;
}
// Convenience: build a 4-byte name from a C string (space-pad / truncate to 4).
static int store_find_str(const char *s4) {
    uint8_t name[STORE_NAME_LEN];
    for (uint8_t i = 0; i < STORE_NAME_LEN; i++) name[i] = (s4[i] != '\0') ? (uint8_t)s4[i] : (uint8_t)' ';
    return store_find(name);
}
static int store_alloc_str(const char *s4) {
    uint8_t name[STORE_NAME_LEN];
    for (uint8_t i = 0; i < STORE_NAME_LEN; i++) name[i] = (s4[i] != '\0') ? (uint8_t)s4[i] : (uint8_t)' ';
    return store_alloc(name);
}

// Boot scan: load the latest valid entry per name into a RAM slot.
static void store_load(void) {
    for (uint8_t i = 0; i < STORE_SLOTS; i++) {
        g_rec_used[i] = false;
        g_rec_seq[i] = 0; g_rec_len[i] = 0; g_rec_row[i] = -1; g_rec_dirty[i] = false;
    }
    for (uint16_t r = 0; r < STORE_ROWS; r++) {
        const store_entry_t *e = store_row(r);
        if (!store_entry_valid(e)) continue;
        int slot = store_alloc(e->name);
        if (slot < 0) continue;                 // RAM-shadow cap: >STORE_SLOTS distinct names on flash
        if (e->seq > g_rec_seq[slot]) {
            g_rec_seq[slot] = e->seq;
            g_rec_len[slot] = e->len;
            g_rec_row[slot] = (int16_t)r;
            memcpy(g_rec_data[slot], e->data, e->len);
        }
    }
    g_store_wr_cursor = 0;
}

static bool store_row_live(uint16_t r) {
    for (uint8_t i = 0; i < STORE_SLOTS; i++)
        if (g_rec_used[i] && g_rec_row[i] == (int16_t)r) return true;
    return false;
}

// Append slot `slot`'s working copy to flash (round-robin non-live row).
static bool store_commit(uint8_t slot) {
    if (slot >= STORE_SLOTS || !g_rec_used[slot]) return false;
    // coalesce: identical to the live entry -> skip the flash write.
    if (g_rec_row[slot] >= 0) {
        const store_entry_t *cur = store_row((uint16_t)g_rec_row[slot]);
        if (cur->len == g_rec_len[slot] && memcmp(cur->data, g_rec_data[slot], g_rec_len[slot]) == 0) {
            g_rec_dirty[slot] = false; return true;
        }
    }
    uint16_t picked = 0xFFFFu;
    for (uint16_t n = 0; n < STORE_ROWS; n++) {
        uint16_t rr = (uint16_t)((g_store_wr_cursor + n) % STORE_ROWS);
        if (!store_row_live(rr)) { picked = rr; break; }
    }
    if (picked == 0xFFFFu) return false;   // impossible: rows > slots
    g_store_wr_cursor = (uint16_t)((picked + 1u) % STORE_ROWS);

    store_entry_t e;
    memset(&e, 0xFF, sizeof e);
    e.magic  = STORE_ENTRY_MAGIC;
    e.seq    = g_rec_seq[slot] + 1u;
    memcpy(e.name, g_rec_name[slot], STORE_NAME_LEN);
    e.len    = g_rec_len[slot];
    e.crc    = store_crc(e.name, e.len, g_rec_data[slot]);
    memcpy(e.data, g_rec_data[slot], e.len);

    uint32_t addr = STORE_BASE + (uint32_t)picked * STORE_ROW_SIZE;
    cs_nvm_erase_row(addr);
    for (uint32_t p = 0; p < STORE_ROW_SIZE; p += STORE_PAGE_SIZE)
        cs_nvm_write_page(addr + p, (const uint8_t *)&e + p, STORE_PAGE_SIZE);

    const store_entry_t *chk = store_row(picked);
    if (!store_entry_valid(chk) || chk->seq != e.seq ||
        memcmp(chk->name, e.name, STORE_NAME_LEN) != 0) return false;
    g_rec_seq[slot] = e.seq;
    g_rec_row[slot] = (int16_t)picked;
    g_rec_dirty[slot] = false;
    return true;
}

// Called from the main superloop: service a pending commit (flash write ~ms) or
// a deferred soft reset (so the master's RESET write is ACKed before we drop).
static void pio_il_tick(void);             // PIO-b gpio interlock eval (defined below)
static void adc_sample_tick(void);         // ADC-a sampler (defined below)
static void mixed_tick(void);              // MIXED-a interlock eval (defined below)

void i2c_store_service(void) {
    if (g_commit_pending >= 0) {
        g_status |= 0x01u;                 // flash-busy
        bool ok = store_commit((uint8_t)g_commit_pending);
        if (!ok) g_status |= 0x02u;        // store-err (sticky until reload)
        g_status &= (uint8_t)~0x01u;       // clear busy
        g_commit_pending = -1;
    }
    if (g_reset_pending) NVIC_SystemReset();
    pio_il_tick();                         // evaluate the gpio interlock (no-op unless armed in PIO)
    adc_sample_tick();                     // 1 kHz ADC sweep + window stats (no-op unless MODE_ADC)
    mixed_tick();                          // ~100 Hz mixed ADC+GPIO interlock (no-op unless MODE_MIXED)
}

// ---- PIO mode (PIO-a): 8-bit GPIO expander, CH0..CH7 = D0-D3, D6-D9 ---------
// MCP23008-style IODIR/GPPU/IPOL/OLAT/GPIO. Pins are claimed only while MODE=PIO
// (entering overrides DAC/SERCOM4 on those pads; leaving sets them safe=inputs).
// Outputs keep INEN on so GPIO-read returns the driven level (no jumper needed).
// PIO-b will layer the gpio interlock (INT on D10 + safe-drive) on top.
#define REG_PIO_IODIR  0x10u
#define REG_PIO_GPPU   0x11u
#define REG_PIO_IPOL   0x12u
#define REG_PIO_GPIO   0x13u
#define REG_PIO_OLAT   0x14u
#define REG_PIO_GPPD   0x17u            // pull-DOWN enable (companion to GPPU pull-up)
#define REG_PIO_OD     0x18u            // RO: open-drain output mask (commission-static)

static const struct { uint8_t group, pin; } g_pio_ch[8] = {
    {0, 2}, {0, 4}, {0, 10}, {0, 11},   // CH0..3 = D0 D1 D2 D3
    {1, 9}, {0,  7}, {0,  5}, {0,  6},   // CH4..7 = D7 D8 D9 D10  (D6 is now INT)
};
static uint8_t g_pio_iodir = 0xFFu;   // power-on default: all inputs (safe)
static uint8_t g_pio_gppu;            // pull-UP enable   (gpmp PULLEN &  OUT)
static uint8_t g_pio_gppd;            // pull-DOWN enable (gpmp PULLEN & ~OUT)
static uint8_t g_pio_od;              // open-drain outputs (gpmp OD): value 1 -> Hi-Z
static uint8_t g_pio_ipol;
static uint8_t g_pio_olat;

// Drive output channel ch to its g_pio_olat value, honoring open-drain (g_pio_od):
// push-pull -> drive the level; open-drain -> value 0 = drive low, value 1 = Hi-Z
// (released), so several chips can wire-OR a shared line.
static void pio_drive_ch_out(uint8_t ch) {
    uint8_t g = g_pio_ch[ch].group, p = g_pio_ch[ch].pin, bit = (uint8_t)(1u << ch);
    uint32_t m = 1u << p;
    if ((g_pio_od & bit) && (g_pio_olat & bit)) {       // open-drain, value 1 -> release
        PORT->Group[g].DIRCLR.reg = m;                  // Hi-Z
    } else {                                            // drive (push-pull, or od value 0 = low)
        if (g_pio_olat & bit) PORT->Group[g].OUTSET.reg = m;
        else                  PORT->Group[g].OUTCLR.reg = m;
        PORT->Group[g].DIRSET.reg = m;
    }
}
static void pio_apply_ch(uint8_t ch) {
    uint8_t g = g_pio_ch[ch].group, p = g_pio_ch[ch].pin, bit = (uint8_t)(1u << ch);
    if (g_pio_iodir & bit) {                            // input
        PORT->Group[g].DIRCLR.reg = (1u << p);
        if (g_pio_gppu & bit) {                         // input + pull-up
            PORT->Group[g].OUTSET.reg = (1u << p);      // OUT=1 selects pull-up direction
            PORT->Group[g].PINCFG[p].reg = PORT_PINCFG_INEN | PORT_PINCFG_PULLEN;
        } else if (g_pio_gppd & bit) {                  // input + pull-down
            PORT->Group[g].OUTCLR.reg = (1u << p);      // OUT=0 selects pull-down direction
            PORT->Group[g].PINCFG[p].reg = PORT_PINCFG_INEN | PORT_PINCFG_PULLEN;
        } else {
            PORT->Group[g].PINCFG[p].reg = PORT_PINCFG_INEN;
        }
    } else {                                            // output (INEN kept for read-back)
        PORT->Group[g].PINCFG[p].reg = PORT_PINCFG_INEN;
        pio_drive_ch_out(ch);                           // od-aware: drive level or Hi-Z
    }
}
static void pio_apply_all(void) { for (uint8_t i = 0; i < 8; i++) pio_apply_ch(i); }
static void pio_update_outputs(void) {                  // OLAT change: just the output pins
    for (uint8_t i = 0; i < 8; i++) {
        if (g_pio_iodir & (1u << i)) continue;
        pio_drive_ch_out(i);                            // od-aware
    }
}
static void pio_safe_all(void) {                        // leaving PIO: all inputs, no pull
    g_pio_iodir = 0xFFu; g_pio_olat = 0u; g_pio_gppu = 0u; g_pio_gppd = 0u; g_pio_od = 0u;
    for (uint8_t i = 0; i < 8; i++) {
        uint8_t g = g_pio_ch[i].group, p = g_pio_ch[i].pin;
        PORT->Group[g].DIRCLR.reg = (1u << p);
        PORT->Group[g].PINCFG[p].reg = PORT_PINCFG_INEN;
    }
}
static uint8_t pio_read_gpio(void) {
    uint8_t v = 0u;
    for (uint8_t i = 0; i < 8; i++) {
        uint8_t g = g_pio_ch[i].group, p = g_pio_ch[i].pin;
        if (PORT->Group[g].IN.reg & (1u << p)) v |= (uint8_t)(1u << i);
    }
    return (uint8_t)(v ^ g_pio_ipol);                   // input polarity invert
}

// Apply the commissioned GPIO power-on pin map ("gpmp") to the channel shadow
// registers; pio_apply_all() then programs the pads. Bit i = channel i.
//   v1 (5 B): [VER=1, DIR(output=1), PULLEN, OUT(level/pull-dir), INTCFG]
//   v2 (6 B): [VER=2, DIR, PULLEN, OUT, OD(open-drain outputs), INTCFG]
// Absent / short / unknown-version -> leave the safe default (all inputs, no pull).
static void gpmp_apply(void) {
    int s = store_find_str("gpmp");
    if (s < 0 || g_rec_len[s] < 5u) return;
    const uint8_t *m = g_rec_data[s];
    if (m[0] == 2u && g_rec_len[s] >= 6u) g_pio_od = m[4];
    else if (m[0] == 1u)                  g_pio_od = 0u;
    else                                  return;          // unknown version
    uint8_t dir = m[1], pullen = m[2], out = m[3];
    g_pio_iodir = (uint8_t)~dir;                          // firmware convention: input = 1
    g_pio_olat  = out;                                    // output drive levels (input bits unused)
    g_pio_gppu  = (uint8_t)(pullen & out);                // pulled input, OUT=1 -> pull-up
    g_pio_gppd  = (uint8_t)(pullen & (uint8_t)~out);      // pulled input, OUT=0 -> pull-down
}

