glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_commands.c
// ---- PIO mode (PIO-b): gpio interlock layered on the expander -----------------
// The interlock_cfg record holds a DSL string (reuses il_parse from the RS-485
// interlock engine). Entering PIO parses it; a tick run from i2c_store_service
// (superloop) evaluates the watches against the channel pins. On trip it LATCHES:
// drives the out_err pins to their safe value (overriding the master's OLAT) and
// asserts INT on D10 (PA06). The master sees the trip in INT_FLAGS (0x04) and
// clears it with a write-1 — that write IS the manual reset: if the fault has
// cleared the interlock re-arms, otherwise the next tick re-trips.
#define REG_PIO_ILSTAT  0x15u           // RO: last il_parse status (0 = OK/armed, 0xFF = no record)
#define REG_PIO_ILSTATE 0x16u           // RO: bit0=tripped bit1=condition-ok bit2=valid/armed
#define PIO_INT_GROUP  1u
#define PIO_INT_PIN    8u               // INT = D6 = PB08 (not one of the 8 channels; D10 is now CH7)

static il_inst_t g_pio_il;
static bool      g_pio_il_valid;        // a DSL parsed OK and has >=1 watch
static bool      g_pio_il_tripped;      // latched trip state
static uint8_t   g_pio_il_pstat = 0xFFu; // il_parse_status_t (0xFF = no record yet)
static volatile uint8_t g_pio_il_state;  // tick snapshot: bit0 tripped, bit1 cond-ok, bit2 valid

static uint8_t pio_phys_read(uint8_t phys) {
    return (PORT->Group[phys >> 5].IN.reg & (1u << (phys & 0x1Fu))) ? 1u : 0u;
}
static void pio_phys_drive(uint8_t phys, uint8_t v) {
    uint8_t grp = phys >> 5, pin = phys & 0x1Fu;
    uint32_t m = 1u << pin;
    // Open-drain if this phys is a channel flagged in g_pio_od: value 1 -> release.
    for (uint8_t ch = 0; ch < 8; ch++) {
        if (g_pio_ch[ch].group == grp && g_pio_ch[ch].pin == pin) {
            if ((g_pio_od & (1u << ch)) && v) { PORT->Group[grp].DIRCLR.reg = m; return; }
            break;
        }
    }
    if (v) PORT->Group[grp].OUTSET.reg = m;
    else   PORT->Group[grp].OUTCLR.reg = m;
    PORT->Group[grp].DIRSET.reg = m;                    // ensure driven (od low / push-pull)
}
// INT (D6) is open-drain, active-low: asserted -> actively drive 0; released ->
// Hi-Z (pin to input), so several chips can wire-OR onto one shared INT line
// (external pull-up holds it high when nobody is tripped).
static void pio_int_assert(bool on) {
    uint32_t m = 1u << PIO_INT_PIN;
    if (on) {
        PORT->Group[PIO_INT_GROUP].OUTCLR.reg = m;   // drive low
        PORT->Group[PIO_INT_GROUP].DIRSET.reg = m;
    } else {
        PORT->Group[PIO_INT_GROUP].DIRCLR.reg = m;   // release: Hi-Z
    }
}

static bool pio_watch_pass(const il_watch_t* w) {
    uint16_t v = pio_phys_read(g_pio_il.inputs[w->input_idx].phys_id);   // digital 0/1
    switch (w->op) {
    case IL_OP_EQ: return v == w->threshold;
    case IL_OP_NE: return v != w->threshold;
    case IL_OP_LT: return v <  w->threshold;
    case IL_OP_GT: return v >  w->threshold;
    case IL_OP_LE: return v <= w->threshold;
    case IL_OP_GE: return v >= w->threshold;
    default:       return true;
    }
}
static void pio_il_drive_safe(void) {                   // force out_err pins to the safe value
    for (uint8_t i = 0; i < g_pio_il.output_count; i++)
        pio_phys_drive(g_pio_il.outputs[i].phys_id, g_pio_il.outputs[i].err_value);
}
// Arm from the interlock_cfg record; set up INT pin (D10 output, deasserted).
static void pio_il_arm(void) {
    g_pio_il_valid = false; g_pio_il_tripped = false;
    PORT->Group[PIO_INT_GROUP].PINCFG[PIO_INT_PIN].reg = PORT_PINCFG_INEN;
    PORT->Group[PIO_INT_GROUP].DIRCLR.reg = (1u << PIO_INT_PIN);   // open-drain INT: Hi-Z idle
    g_pio_il_state = 0u;
    int ils = store_find_str("ilcf");      // interlock-config named slot
    if (ils >= 0 && g_rec_len[ils] > 0u) {
        g_pio_il_pstat = (uint8_t)il_parse((const char*)g_rec_data[ils],
                                           g_rec_len[ils], &g_pio_il, NULL);
        if (g_pio_il_pstat == (uint8_t)IL_PARSE_OK && g_pio_il.watch_count > 0u)
            g_pio_il_valid = true;
    } else {
        g_pio_il_pstat = 0xFFu;             // no interlock_cfg record present
    }
}
static void pio_il_disarm(void) {           // leaving PIO mode
    g_pio_il_valid = false; g_pio_il_tripped = false;
    pio_int_assert(false);
}
static void pio_il_tick(void) {             // run from i2c_store_service (superloop)
    if (g_mode != MODE_PIO || !g_pio_il_valid) return;
    bool wpass[IL_MAX_WATCHES] = {0};
    for (uint8_t i = 0; i < g_pio_il.watch_count; i++)
        wpass[i] = pio_watch_pass(&g_pio_il.watches[i]);
    bool all_pass = il_dnf_result(&g_pio_il, wpass);   // DNF: OR of AND-groups
    g_pio_il_state = (uint8_t)((g_pio_il_tripped ? 1u : 0u) | (all_pass ? 2u : 0u) | 4u);
    if (!g_pio_il_tripped) {
        if (!all_pass) {                                     // a watch failed -> TRIP (latched)
            g_pio_il_tripped = true;
            g_int_flags |= 0x01u;
            pio_il_drive_safe();
            pio_int_assert(true);
        }
    } else {
        pio_il_drive_safe();                // hold the safe outputs each tick (override OLAT)
    }
}
// Master cleared the trip bit in INT_FLAGS -> manual reset. Re-arm; if the fault
// persists the next tick re-trips, otherwise the master's OLAT resumes driving.
static void pio_il_manual_reset(void) {
    if (!g_pio_il_tripped) return;
    g_pio_il_tripped = false;
    pio_int_assert(false);
    pio_update_outputs();                   // restore master OLAT on the freed output pins
}

// PIO mode-bank register access (0x10-0x16), dispatched only while MODE_PIO.
static uint8_t pio_reg_read(uint8_t reg) {
    switch (reg) {
    case REG_PIO_IODIR:   return g_pio_iodir;
    case REG_PIO_GPPU:    return g_pio_gppu;
    case REG_PIO_GPPD:    return g_pio_gppd;
    case REG_PIO_IPOL:    return g_pio_ipol;
    case REG_PIO_GPIO:    return pio_read_gpio();
    case REG_PIO_OLAT:    return g_pio_olat;
    case REG_PIO_OD:      return g_pio_od;
    case REG_PIO_ILSTAT:  return g_pio_il_pstat;
    case REG_PIO_ILSTATE: return g_pio_il_state;
    default:              return 0xFFu;
    }
}
static void pio_reg_write(uint8_t reg, uint8_t val) {
    switch (reg) {
    // DIR/PULL/OD are the fixed wiring description: set once by gpmp at boot,
    // read-only at runtime (the board can't change). Only output VALUES + the
    // read-polarity are writable.
    case REG_PIO_IODIR:
    case REG_PIO_GPPU:
    case REG_PIO_GPPD:
    case REG_PIO_OD:    break;                             // commission-static, ignore writes
    case REG_PIO_IPOL:  g_pio_ipol  = val; break;
    case REG_PIO_GPIO:                                     // GPIO write == OLAT (MCP-style)
    case REG_PIO_OLAT:  g_pio_olat  = val; pio_update_outputs(); break;
    default: break;
    }
}

// ---- ADC mode (ADC-a): free-running 8-ch sampler + tumbling-window stats ------
// DIV16 (3 MHz) ADC, 16x hardware oversample, swept at 1 kHz from the superloop.
// Per channel, three tumbling windows (10/1/0.1 Hz = 100/1000/10000 samples) keep
// running min/max/sum/sumsq; on window-fill they snapshot min/max/avg/AC-rms into
// a readable block and bump a per-window seq id (freshness + seqlock). Selector +
// block register access. DAC sub-state is constant-only here; ADC-b adds waves.
#define ADC_NCH   8u
#define ADC_NWIN  3u
#define REG_ADC_CH_SEL  0x10u            // w: channel 0..7
#define REG_ADC_WIN_SEL 0x11u            // w: window 0=10Hz 1=1Hz 2=0.1Hz
#define REG_ADC_SEQ     0x12u            // r: u16 window snapshot counter
#define REG_ADC_MIN     0x14u            // r: u16  (block 0x12..0x1B = seq,min,max,avg,rms)
#define REG_ADC_MAX     0x16u
#define REG_ADC_AVG     0x18u
#define REG_ADC_RMS     0x1Au
#define REG_DAC_MODE    0x20u            // w: 0=constant (1=sine 2=square in ADC-b)
#define REG_DAC_LEVEL   0x21u            // w: u16 level/amplitude 0..1023
#define REG_DAC_FREQ    0x23u            // w: u16 Hz
#define REG_DAC_APPLY   0x25u            // w: latch MODE+LEVEL+FREQ

