glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_commands.c
static const uint8_t  g_adc_ain[ADC_NCH]     = { 4u, 18u, 19u, 2u, 3u, 7u, 5u, 6u }; // D1,D2,D3,D6,D7,D8,D9,D10
static const uint16_t g_adc_win_len[ADC_NWIN] = { 100u, 1000u, 10000u };             // 10/1/0.1 Hz @ 1 kHz

typedef struct { uint16_t min, max; uint32_t sum; uint64_t sumsq; uint16_t count; } adc_accum_t;
typedef struct { uint16_t min, max, avg, rms; } adc_stat_t;
static adc_accum_t g_adc_acc[ADC_NCH][ADC_NWIN];
static adc_stat_t  g_adc_stat[ADC_NCH][ADC_NWIN];
static volatile uint16_t g_adc_seq[ADC_NWIN];
static uint8_t   g_adc_ch_sel, g_adc_win_sel;
static uint32_t  g_adc_next_ms;
static uint8_t   g_dac_mode;             // 0=constant
static uint16_t  g_dac_level;            // 0..1023
static uint16_t  g_dac_freq;

static uint32_t isqrt32(uint32_t x) {    // integer sqrt for AC-rms
    uint32_t r = 0u, b = 1u << 30;
    while (b > x) b >>= 2;
    while (b) { if (x >= r + b) { x -= r + b; r = (r >> 1) + b; } else { r >>= 1; } b >>= 2; }
    return r;
}

static void adc_mode_setup(void) {
    adc_init();                                              // idempotent (leaves DIV256)
    ADC->CTRLB.reg = ADC_CTRLB_PRESCALER_DIV16 | ADC_CTRLB_RESSEL_16BIT;   // 3 MHz + averaging mode
    while (ADC->STATUS.bit.SYNCBUSY) { }
    ADC->AVGCTRL.reg = ADC_AVGCTRL_SAMPLENUM_16 | ADC_AVGCTRL_ADJRES(4);   // 16x, ADJRES quirk
    ADC->SAMPCTRL.reg = 3u;                                 // short sample-hold (low-Z sources)
    while (ADC->STATUS.bit.SYNCBUSY) { }
    for (uint8_t ch = 0; ch < ADC_NCH; ch++) {
        ain_to_pad_t pad = g_ain_to_pad[g_adc_ain[ch]];
        if (pad.port != 0xFFu) adc_pin_config(pad.port, pad.pin);
    }
    memset(g_adc_acc, 0, sizeof g_adc_acc);
    memset(g_adc_stat, 0, sizeof g_adc_stat);
    for (uint8_t w = 0; w < ADC_NWIN; w++) g_adc_seq[w] = 0u;
    dac_init();                                             // D0 = DAC out (constant)
    PORT->Group[0].PINCFG[2].bit.PMUXEN = 1;                // re-route PA02 to the DAC (PIO mode may
    PORT->Group[0].PMUX[1].bit.PMUXE    = PORT_PMUX_PMUXE_B_Val;  // have left it a GPIO; dac_init is 1-shot)
    DAC->CTRLB.bit.EOEN = 1;
    while (DAC->STATUS.bit.SYNCBUSY) { }
    DAC->DATA.reg = g_dac_level;
    g_adc_next_ms = board_millis();
}

static uint16_t adc_convert(uint8_t ain) {
    ADC->INPUTCTRL.bit.MUXPOS = ain;
    while (ADC->STATUS.bit.SYNCBUSY) { }
    // Throwaway conversion: after a mux switch the sample cap still holds the
    // previous (possibly floating) channel; the first averaged result is
    // contaminated. Discard it so the real read settles on the new channel.
    ADC->INTFLAG.reg = ADC_INTFLAG_RESRDY;
    ADC->SWTRIG.bit.START = 1;
    while (!ADC->INTFLAG.bit.RESRDY) { }
    (void)ADC->RESULT.reg;
    ADC->INTFLAG.reg = ADC_INTFLAG_RESRDY;
    // Real averaged conversion.
    ADC->SWTRIG.bit.START = 1;
    while (!ADC->INTFLAG.bit.RESRDY) { }
    uint16_t v = (uint16_t)ADC->RESULT.reg;
    ADC->INTFLAG.reg = ADC_INTFLAG_RESRDY;
    return v;
}

static void adc_sample_tick(void) {
    if (g_mode != MODE_ADC) return;
    uint32_t now = board_millis();
    if ((int32_t)(now - g_adc_next_ms) < 0) return;          // 1 kHz gate (1 ms)
    g_adc_next_ms = now + 1u;
    for (uint8_t ch = 0; ch < ADC_NCH; ch++) {
        uint16_t v = adc_convert(g_adc_ain[ch]);
        if (v > 4095u) v = 4095u;
        for (uint8_t w = 0; w < ADC_NWIN; w++) {
            adc_accum_t *a = &g_adc_acc[ch][w];
            if (a->count == 0u) { a->min = v; a->max = v; }
            else { if (v < a->min) a->min = v; if (v > a->max) a->max = v; }
            a->sum   += v;
            a->sumsq += (uint32_t)v * (uint32_t)v;
            a->count++;
        }
    }
    for (uint8_t w = 0; w < ADC_NWIN; w++) {
        if (g_adc_acc[0][w].count >= g_adc_win_len[w]) {     // window full -> snapshot all channels
            for (uint8_t ch = 0; ch < ADC_NCH; ch++) {
                adc_accum_t *a = &g_adc_acc[ch][w];
                uint16_t n = a->count;
                uint32_t avg = n ? (uint32_t)(a->sum / n) : 0u;
                // AC-rms = sqrt(var); var = (n*sumsq - sum^2) / n^2, computed in u64
                // from the raw sums so avg truncation doesn't pollute it.
                uint32_t var = 0u;
                if (n) {
                    uint64_t nss = (uint64_t)n * a->sumsq;
                    uint64_t ss  = (uint64_t)a->sum * a->sum;
                    if (nss > ss) var = (uint32_t)((nss - ss) / ((uint64_t)n * n));
                }
                g_adc_stat[ch][w].min = a->min;
                g_adc_stat[ch][w].max = a->max;
                g_adc_stat[ch][w].avg = (uint16_t)avg;
                g_adc_stat[ch][w].rms = (uint16_t)isqrt32(var);
                a->min = 0u; a->max = 0u; a->count = 0u; a->sum = 0u; a->sumsq = 0u;
            }
            g_adc_seq[w]++;
        }
    }
}

// ADC-b: latch the DAC sub-state (constant / sine / square) from MODE+LEVEL+FREQ.
// Reuses the TC3 waveform engine; sine/square are centered at mid-scale (offset
// 512) with peak-to-peak swing = LEVEL, so the jumpered ADC captures the wave.
static void adc_dac_apply(void) {
    if (g_dac_level > 1023u) g_dac_level = 1023u;
    if (g_dac_mode == 0u) {                                  // constant
        NVIC_DisableIRQ(TC3_IRQn);
        g_dac_wf.active = false;
        tc3_stop();
        DAC->DATA.reg = g_dac_level;
        return;
    }
    uint32_t freq = g_dac_freq;                              // sine (1) / square (2)
    if (freq < DAC_WF_FREQ_MIN) freq = DAC_WF_FREQ_MIN;
    if (freq > DAC_WF_FREQ_MAX) freq = DAC_WF_FREQ_MAX;
    uint32_t period = 48000000u / (freq * DAC_WF_PHASE_STEPS);
    if (period < 2u) period = 2u;
    if (period > 65535u) period = 65535u;
    dac_init();
    tc3_init_once();
    NVIC_DisableIRQ(TC3_IRQn);
    g_dac_wf.active         = true;
    g_dac_wf.waveform_type  = (g_dac_mode == 2u) ? DAC_WF_TYPE_SQUARE : DAC_WF_TYPE_SINE;
    g_dac_wf.amplitude      = g_dac_level;                   // peak-to-peak swing
    g_dac_wf.offset         = 512u;                          // centered at mid-scale
    g_dac_wf.isrs_remaining = 0u;                            // infinite
    g_dac_wf.phase          = 0u;
    tc3_start_at_period((uint16_t)period);                   // re-enables NVIC
}

// ADC mode-bank register access (0x10-0x25), dispatched only while MODE_ADC.
static uint8_t adc_reg_read(uint8_t reg) {
    if (reg >= REG_ADC_SEQ && reg <= REG_ADC_RMS + 1u
        && g_adc_ch_sel < ADC_NCH && g_adc_win_sel < ADC_NWIN) {
        uint8_t off = (uint8_t)(reg - REG_ADC_SEQ);          // 0..9 -> seq,min,max,avg,rms (5x u16)
        const adc_stat_t *st = &g_adc_stat[g_adc_ch_sel][g_adc_win_sel];
        uint16_t blk[5] = { g_adc_seq[g_adc_win_sel], st->min, st->max, st->avg, st->rms };
        uint16_t v = blk[off >> 1];
        return (off & 1u) ? (uint8_t)(v >> 8) : (uint8_t)v;
    }
    switch (reg) {
    case REG_ADC_CH_SEL:  return g_adc_ch_sel;
    case REG_ADC_WIN_SEL: return g_adc_win_sel;
    case REG_DAC_MODE:     return g_dac_mode;
    case REG_DAC_LEVEL:    return (uint8_t)g_dac_level;
    case REG_DAC_LEVEL+1u: return (uint8_t)(g_dac_level >> 8);
    case REG_DAC_FREQ:     return (uint8_t)g_dac_freq;
    case REG_DAC_FREQ+1u:  return (uint8_t)(g_dac_freq >> 8);
    default:               return 0xFFu;
    }
}
static void adc_reg_write(uint8_t reg, uint8_t val) {
    switch (reg) {
    case REG_ADC_CH_SEL:  if (val < ADC_NCH)  g_adc_ch_sel  = val; break;
    case REG_ADC_WIN_SEL: if (val < ADC_NWIN) g_adc_win_sel = val; break;
    case REG_DAC_MODE:     g_dac_mode  = val; break;
    case REG_DAC_LEVEL:    g_dac_level = (uint16_t)((g_dac_level & 0xFF00u) | val); break;
    case REG_DAC_LEVEL+1u: g_dac_level = (uint16_t)((g_dac_level & 0x00FFu) | ((uint16_t)val << 8)); break;
    case REG_DAC_FREQ:     g_dac_freq  = (uint16_t)((g_dac_freq  & 0xFF00u) | val); break;
    case REG_DAC_FREQ+1u:  g_dac_freq  = (uint16_t)((g_dac_freq  & 0x00FFu) | ((uint16_t)val << 8)); break;
    case REG_DAC_APPLY:   adc_dac_apply(); break;            // constant / sine / square
    default: break;
    }
}

