glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_commands.c
#define REG_SERVO_CH_SEL    0x10u
#define REG_SERVO_WIDTH_L   0x11u
#define REG_SERVO_WIDTH_H   0x12u
#define REG_SERVO_ENABLE_L  0x13u
#define REG_SERVO_ENABLE_H  0x14u

// us -> TC4 ticks at 750 kHz (1.333 µs/tick). Exact for the 3/4 ratio.
#define SERVO_US_TO_TICKS(us)  ((uint16_t)((uint32_t)(us) * 3u / 4u))

// Channel index -> (port group, pin). 7 on PORT A (group 0), 2 on PORT B (group 1).
// CH0 D0 PA02  CH1 D1 PA04  CH2 D2 PA10  CH3 D3 PA11  CH4 D7 PB09
// CH5 D8 PA07  CH6 D9 PA05  CH7 D10 PA06  CH8 D6 PB08
typedef struct { uint8_t group; uint8_t pin; } servo_pad_t;
static const servo_pad_t g_servo_pad[SERVO_CH_COUNT] = {
    {0,  2}, {0,  4}, {0, 10}, {0, 11}, {1,  9},
    {0,  7}, {0,  5}, {0,  6}, {1,  8},
};

static uint16_t g_servo_us[SERVO_CH_COUNT] = {
    SERVO_US_DEFAULT, SERVO_US_DEFAULT, SERVO_US_DEFAULT,
    SERVO_US_DEFAULT, SERVO_US_DEFAULT, SERVO_US_DEFAULT,
    SERVO_US_DEFAULT, SERVO_US_DEFAULT, SERVO_US_DEFAULT,
};
static uint16_t g_servo_enable;              // 9-bit enable mask (default 0 -> silent)
static uint8_t  g_servo_ch_sel;              // selected channel for the WIDTH window
static uint16_t g_servo_width_stage;         // WIDTH_L/H accumulator (latched on WIDTH_H write)

// Built schedule (recomputed by servo_build()). The ISR consumes raise masks at
// the frame boundary and walks the sorted/merged drop events.
static uint32_t g_servo_raise_a;             // PORT A bits of all enabled servos
static uint32_t g_servo_raise_b;             // PORT B bits of all enabled servos
static struct { uint16_t t; uint32_t clr_a, clr_b; } g_servo_evt[SERVO_CH_COUNT];
static uint8_t  g_servo_evt_n;               // number of drop events (distinct widths)
static volatile uint8_t g_servo_evt_idx;     // ISR walk cursor

static bool g_servo_tc_initialized;          // TC4 GCLK/APBC wired once

// ---- TC4 timebase (mirrors the TC3 DAC engine: MFRQ CC0=TOP, SYNCBUSY spins) --
static void servo_tc_init_once(void) {
    if (g_servo_tc_initialized) return;
    PM->APBCMASK.reg |= PM_APBCMASK_TC4;
    GCLK->CLKCTRL.reg = (uint16_t)(GCLK_CLKCTRL_ID(TC4_GCLK_ID)   // TC4_GCLK_ID == TC5_GCLK_ID (28)
                                 | GCLK_CLKCTRL_GEN_GCLK0
                                 | GCLK_CLKCTRL_CLKEN);
    while (GCLK->STATUS.bit.SYNCBUSY) { /* spin */ }
    g_servo_tc_initialized = true;
}

static void servo_tc_stop(void) {
    NVIC_DisableIRQ(TC4_IRQn);
    TC4->COUNT16.INTENCLR.reg = TC_INTENCLR_MC0 | TC_INTENCLR_MC1;
    TC4->COUNT16.CTRLA.bit.ENABLE = 0;
    while (TC4->COUNT16.STATUS.bit.SYNCBUSY) { /* spin */ }
}

static void servo_tc_start(void) {
    // Reset.
    TC4->COUNT16.CTRLA.bit.SWRST = 1;
    while (TC4->COUNT16.STATUS.bit.SYNCBUSY) { /* spin */ }
    while (TC4->COUNT16.CTRLA.bit.SWRST)     { /* spin */ }

    // 16-bit count, MFRQ wavegen (CC0=TOP and resets the counter), /64 prescaler.
    TC4->COUNT16.CTRLA.reg = TC_CTRLA_MODE_COUNT16
                           | TC_CTRLA_WAVEGEN_MFRQ
                           | TC_CTRLA_PRESCALER_DIV64;
    TC4->COUNT16.CC[0].reg = SERVO_US_TO_TICKS(SERVO_FRAME_US);   // 15000 ticks = 20 ms
    TC4->COUNT16.CC[1].reg = 0;
    while (TC4->COUNT16.STATUS.bit.SYNCBUSY) { /* spin */ }

    TC4->COUNT16.INTFLAG.reg = TC_INTFLAG_MC0 | TC_INTFLAG_MC1;   // clear stale
    TC4->COUNT16.INTENSET.reg = TC_INTENSET_MC0;                  // frame boundary; MC1 armed per-frame
    NVIC_EnableIRQ(TC4_IRQn);

    TC4->COUNT16.CTRLA.bit.ENABLE = 1;
    while (TC4->COUNT16.STATUS.bit.SYNCBUSY) { /* spin */ }
}

// Recompute the raise masks + sorted/merged drop events from the current
// enable mask + per-channel widths. Servos with EQUAL width merge into one drop
// event (their port bits OR'd into clr_a/clr_b). Updates are made coherent vs the
// ISR by masking the TC4 IRQ around the swap (like the DAC engine masks TC3).
static void servo_build(void) {
    uint32_t raise_a = 0u, raise_b = 0u;
    struct { uint16_t t; uint32_t clr_a, clr_b; } evt[SERVO_CH_COUNT];
    uint8_t n = 0u;

    for (uint8_t ch = 0; ch < SERVO_CH_COUNT; ch++) {
        if (!(g_servo_enable & (1u << ch))) continue;
        uint16_t us = g_servo_us[ch];
        if (us < SERVO_US_MIN) us = SERVO_US_MIN;
        if (us > SERVO_US_MAX) us = SERVO_US_MAX;
        uint16_t t = SERVO_US_TO_TICKS(us);
        uint32_t bit = (1u << g_servo_pad[ch].pin);
        if (g_servo_pad[ch].group == 0u) raise_a |= bit; else raise_b |= bit;

        // Insertion-sort by tick-time, merging equal times into one event.
        uint8_t i = 0;
        while (i < n && evt[i].t < t) i++;
        if (i < n && evt[i].t == t) {
            if (g_servo_pad[ch].group == 0u) evt[i].clr_a |= bit; else evt[i].clr_b |= bit;
        } else {
            for (uint8_t j = n; j > i; j--) evt[j] = evt[j - 1u];
            evt[i].t = t;
            evt[i].clr_a = (g_servo_pad[ch].group == 0u) ? bit : 0u;
            evt[i].clr_b = (g_servo_pad[ch].group == 0u) ? 0u : bit;
            n++;
        }
    }

    // Install atomically vs the ISR: mask TC4, swap, restore.
    NVIC_DisableIRQ(TC4_IRQn);
    g_servo_raise_a = raise_a;
    g_servo_raise_b = raise_b;
    for (uint8_t i = 0; i < n; i++) {
        g_servo_evt[i].t     = evt[i].t;
        g_servo_evt[i].clr_a = evt[i].clr_a;
        g_servo_evt[i].clr_b = evt[i].clr_b;
    }
    g_servo_evt_n   = n;
    g_servo_evt_idx = 0u;
    if (g_servo_tc_initialized) NVIC_EnableIRQ(TC4_IRQn);
}

// Configure all 9 servo pins as GPIO outputs driven low. Mirrors cmd_gpio_config's
// output path (clear PMUXEN, clear INEN/PULLEN, OUTCLR, DIRSET).
static void servo_pins_output_low(void) {
    for (uint8_t ch = 0; ch < SERVO_CH_COUNT; ch++) {
        uint8_t g = g_servo_pad[ch].group, p = g_servo_pad[ch].pin;
        uint32_t m = (1u << p);
        PORT->Group[g].PINCFG[p].bit.PMUXEN = 0;
        PORT->Group[g].PINCFG[p].bit.INEN   = 0;
        PORT->Group[g].PINCFG[p].bit.PULLEN = 0;
        PORT->Group[g].OUTCLR.reg = m;
        PORT->Group[g].DIRSET.reg = m;
    }
}

