glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_commands.c
// Entering MODE_SERVO: pins -> GPIO outputs low, build the schedule, start TC4.
static void servo_enter(void) {
    servo_tc_init_once();
    servo_pins_output_low();
    servo_build();
    servo_tc_start();
}

// Leaving MODE_SERVO: stop TC4 (masks IRQ), drive all 9 pins low (safe).
static void servo_exit(void) {
    servo_tc_stop();
    for (uint8_t ch = 0; ch < SERVO_CH_COUNT; ch++)
        PORT->Group[g_servo_pad[ch].group].OUTCLR.reg = (1u << g_servo_pad[ch].pin);
}

// TC4 ISR. MC0 = frame boundary (raise all enabled, schedule first drop);
// MC1 = drop (clear this event's pins, reschedule to the next larger time).
// Bounded + fast: only OUTSET/OUTCLR writes + a short CC1 SYNCBUSY spin.
void TC4_Handler(void) {
    if (TC4->COUNT16.INTFLAG.bit.MC0) {                  // frame boundary (CC0 wrap)
        TC4->COUNT16.INTFLAG.reg = TC_INTFLAG_MC0;
        PORT->Group[0].OUTSET.reg = g_servo_raise_a;     // raise all enabled servos together
        PORT->Group[1].OUTSET.reg = g_servo_raise_b;
        g_servo_evt_idx = 0u;
        if (g_servo_evt_n > 0u) {
            TC4->COUNT16.CC[1].reg = g_servo_evt[0].t;
            while (TC4->COUNT16.STATUS.bit.SYNCBUSY) { /* spin */ }
            TC4->COUNT16.INTENSET.reg = TC_INTENSET_MC1;
        } else {
            TC4->COUNT16.INTENCLR.reg = TC_INTENCLR_MC1;
        }
        return;
    }
    if (TC4->COUNT16.INTFLAG.bit.MC1) {                  // a drop time was reached
        TC4->COUNT16.INTFLAG.reg = TC_INTFLAG_MC1;
        uint8_t idx = g_servo_evt_idx;
        PORT->Group[0].OUTCLR.reg = g_servo_evt[idx].clr_a;
        PORT->Group[1].OUTCLR.reg = g_servo_evt[idx].clr_b;
        idx++;
        g_servo_evt_idx = idx;
        if (idx < g_servo_evt_n) {                       // next time is strictly larger -> safe
            TC4->COUNT16.CC[1].reg = g_servo_evt[idx].t;
            while (TC4->COUNT16.STATUS.bit.SYNCBUSY) { /* spin */ }
        } else {
            TC4->COUNT16.INTENCLR.reg = TC_INTENCLR_MC1; // done this frame
        }
        return;
    }
}

// SERVO mode-bank register access (0x10-0x14), dispatched only while MODE_SERVO.
static uint8_t servo_reg_read(uint8_t reg) {
    uint8_t sel = (g_servo_ch_sel < SERVO_CH_COUNT) ? g_servo_ch_sel : 0u;
    switch (reg) {
    case REG_SERVO_CH_SEL:   return g_servo_ch_sel;
    case REG_SERVO_WIDTH_L:  return (uint8_t)g_servo_us[sel];
    case REG_SERVO_WIDTH_H:  return (uint8_t)(g_servo_us[sel] >> 8);
    case REG_SERVO_ENABLE_L: return (uint8_t)g_servo_enable;
    case REG_SERVO_ENABLE_H: return (uint8_t)(g_servo_enable >> 8);
    default:                 return 0xFFu;
    }
}
static void servo_reg_write(uint8_t reg, uint8_t val) {
    switch (reg) {
    case REG_SERVO_CH_SEL:
        if (val < SERVO_CH_COUNT) g_servo_ch_sel = val;  // out-of-range clamped (ignored)
        break;
    case REG_SERVO_WIDTH_L:                              // stage lo byte; WIDTH_H write latches
        g_servo_width_stage = (uint16_t)((g_servo_width_stage & 0xFF00u) | val);
        break;
    case REG_SERVO_WIDTH_H: {                            // latch: clamp + store + rebuild
        uint16_t us = (uint16_t)(((uint16_t)val << 8) | (g_servo_width_stage & 0x00FFu));
        if (us < SERVO_US_MIN) us = SERVO_US_MIN;
        if (us > SERVO_US_MAX) us = SERVO_US_MAX;
        uint8_t sel = (g_servo_ch_sel < SERVO_CH_COUNT) ? g_servo_ch_sel : 0u;
        g_servo_us[sel] = us;
        g_servo_width_stage = us;                        // reflect the clamped value back
        servo_build();
        break;
    }
    case REG_SERVO_ENABLE_L:
        g_servo_enable = (uint16_t)((g_servo_enable & 0x0100u) | val) & SERVO_ENABLE_MASK;
        servo_build();
        break;
    case REG_SERVO_ENABLE_H:
        g_servo_enable = (uint16_t)((g_servo_enable & 0x00FFu) | ((uint16_t)val << 8)) & SERVO_ENABLE_MASK;
        servo_build();
        break;
    default: break;                                     // unimplemented regs ignored
    }
}

// ============================================================================
// COUNTER mode — 9 software edge counters sampled by a 1 kHz timer ISR (TC5).
//
// Each TC5 tick (1 ms) reads all 9 channel pins, detects edges vs the previous
// sample, and increments per-channel u32 counters on the configured edge. Max
// reliable input is 500 Hz (Nyquist of the 1 kHz sampler). Pure input mode —
// no interlock, no INT (D6/CH8 is just a 9th counter). Mirrors the Pico's
// pulse_sample_1khz (a 1 kHz-sampled software edge counter; zero PIO/EIC).
//
// TC5 shares GCLK_ID 28 with TC4 (servo), but is a separate peripheral; TC4 is
// idle in counter mode. Same 750 kHz tick as servo (DIV64 off the 48 MHz GCLK0),
// so 1 ms = 750 ticks -> CC0=750 with MFRQ wavegen (CC0=TOP, auto-reset). Only
// the MC0 interrupt is used (no CC1).
//
// Mode-bank registers (0x10-0x1A), dispatched only while MODE_COUNTER:
//   0x10 CH_SEL       (rw)  channel 0..8 selected for the COUNT window
//   0x11-0x14 COUNT   (r)   u32 of selected channel (coherent snapshot on 0x11)
//   0x15-0x18 COUNT_RDCLR (r) same, but 0x15 also atomically zeroes the channel
//   0x19 EDGE         (rw)  0=rising 1=falling 2=both for the selected channel
//   0x1A CLEAR        (w)   0xFF -> zero all 9; else zero the selected channel
// ============================================================================
#define COUNTER_CH_COUNT    9u

#define REG_COUNTER_CH_SEL      0x10u
#define REG_COUNTER_COUNT0      0x11u   // 0x11..0x14 -> u32 bytes 0..3 (snapshot on 0x11)
#define REG_COUNTER_COUNT3      0x14u
#define REG_COUNTER_RDCLR0      0x15u   // 0x15..0x18 -> u32 bytes 0..3 (snapshot+clear on 0x15)
#define REG_COUNTER_RDCLR3      0x18u
#define REG_COUNTER_EDGE        0x19u
#define REG_COUNTER_CLEAR       0x1Au

// Channel index -> (port group, pin). SAME pins as the servo bank.
// CH0 D0 PA02  CH1 D1 PA04  CH2 D2 PA10  CH3 D3 PA11  CH4 D7 PB09
// CH5 D8 PA07  CH6 D9 PA05  CH7 D10 PA06  CH8 D6 PB08
static const struct { uint8_t group; uint8_t pin; } g_counter_pad[COUNTER_CH_COUNT] = {
    {0,  2}, {0,  4}, {0, 10}, {0, 11}, {1,  9},
    {0,  7}, {0,  5}, {0,  6}, {1,  8},
};

static volatile uint32_t g_counter[COUNTER_CH_COUNT];   // running totals (ISR is sole writer)
static uint16_t g_counter_last;                         // last sampled 9-bit level bitmap (bit ch)
static uint8_t  g_counter_edge[COUNTER_CH_COUNT];       // 0=rising 1=falling 2=both (default rising)
static uint32_t g_counter_shadow[COUNTER_CH_COUNT];     // coherent read snapshot (taken on byte 0)
static uint8_t  g_counter_ch_sel;                       // selected channel for the COUNT window

static bool g_counter_tc_initialized;                   // TC5 GCLK/APBC wired once

// Read the live 9-bit level bitmap: bit ch = current level of channel ch's pin.
static inline uint16_t counter_sample_now(void) {
    uint16_t now = 0u;
    for (uint8_t ch = 0; ch < COUNTER_CH_COUNT; ch++)
        if (PORT->Group[g_counter_pad[ch].group].IN.reg & (1u << g_counter_pad[ch].pin))
            now |= (uint16_t)(1u << ch);
    return now;
}

