glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_commands.c
// ---- TC5 timebase (mirrors the TC4 servo engine: MFRQ CC0=TOP, SYNCBUSY spins) --
static void counter_tc_init_once(void) {
    if (g_counter_tc_initialized) return;
    PM->APBCMASK.reg |= PM_APBCMASK_TC5;
    GCLK->CLKCTRL.reg = (uint16_t)(GCLK_CLKCTRL_ID(TC5_GCLK_ID)   // TC5_GCLK_ID == TC4_GCLK_ID (28)
                                 | GCLK_CLKCTRL_GEN_GCLK0
                                 | GCLK_CLKCTRL_CLKEN);
    while (GCLK->STATUS.bit.SYNCBUSY) { /* spin */ }
    g_counter_tc_initialized = true;
}

static void counter_tc_stop(void) {
    NVIC_DisableIRQ(TC5_IRQn);
    TC5->COUNT16.INTENCLR.reg = TC_INTENCLR_MC0;
    TC5->COUNT16.CTRLA.bit.ENABLE = 0;
    while (TC5->COUNT16.STATUS.bit.SYNCBUSY) { /* spin */ }
}

static void counter_tc_start(void) {
    // Reset.
    TC5->COUNT16.CTRLA.bit.SWRST = 1;
    while (TC5->COUNT16.STATUS.bit.SYNCBUSY) { /* spin */ }
    while (TC5->COUNT16.CTRLA.bit.SWRST)     { /* spin */ }

    // 16-bit count, MFRQ wavegen (CC0=TOP and resets the counter), /64 prescaler.
    // 48 MHz / 64 = 750 kHz tick; 1 ms (1 kHz) = 750 ticks -> CC0=750.
    TC5->COUNT16.CTRLA.reg = TC_CTRLA_MODE_COUNT16
                           | TC_CTRLA_WAVEGEN_MFRQ
                           | TC_CTRLA_PRESCALER_DIV64;
    TC5->COUNT16.CC[0].reg = 750u;                                // 1 ms tick
    while (TC5->COUNT16.STATUS.bit.SYNCBUSY) { /* spin */ }

    TC5->COUNT16.INTFLAG.reg = TC_INTFLAG_MC0;                    // clear stale
    TC5->COUNT16.INTENSET.reg = TC_INTENSET_MC0;                  // 1 kHz sampler tick
    NVIC_EnableIRQ(TC5_IRQn);

    TC5->COUNT16.CTRLA.bit.ENABLE = 1;
    while (TC5->COUNT16.STATUS.bit.SYNCBUSY) { /* spin */ }
}

// Configure all 9 counter pins as GPIO inputs (no pull). Mirrors cmd_gpio_config's
// input path (clear PMUXEN, DIRCLR, set INEN; clear PULLEN -> floating input).
static void counter_pins_input(void) {
    for (uint8_t ch = 0; ch < COUNTER_CH_COUNT; ch++) {
        uint8_t g = g_counter_pad[ch].group, p = g_counter_pad[ch].pin;
        PORT->Group[g].PINCFG[p].bit.PMUXEN = 0;
        PORT->Group[g].DIRCLR.reg = (1u << p);
        PORT->Group[g].PINCFG[p].reg = PORT_PINCFG_INEN;          // input, no pull
    }
}

// Entering MODE_COUNTER: pins -> GPIO inputs, seed last-level (no phantom first
// edge), zero counters + shadow, start TC5.
static void counter_enter(void) {
    counter_tc_init_once();
    counter_pins_input();
    g_counter_last = counter_sample_now();                       // seed: no edge on first tick
    for (uint8_t ch = 0; ch < COUNTER_CH_COUNT; ch++) {
        g_counter[ch]        = 0u;
        g_counter_shadow[ch] = 0u;
    }
    counter_tc_start();
}

// Leaving MODE_COUNTER: stop TC5 (masks IRQ); pins stay inputs (safe).
static void counter_exit(void) {
    counter_tc_stop();
}

// TC5 ISR — the 1 kHz sampler. Reads all 9 pins, detects edges vs the previous
// sample, and increments the per-channel counter on the configured edge. Bounded
// + fast: one IN read + a 9-iteration loop, no blocking. Mirrors pulse_sample_1khz.
void TC5_Handler(void) {
    if (!TC5->COUNT16.INTFLAG.bit.MC0) return;
    TC5->COUNT16.INTFLAG.reg = TC_INTFLAG_MC0;

    uint16_t now     = counter_sample_now();
    uint16_t changed = now ^ g_counter_last;
    uint16_t rose    = changed & now;             // 0 -> 1
    uint16_t fell    = changed & (uint16_t)~now;  // 1 -> 0
    for (uint8_t ch = 0; ch < COUNTER_CH_COUNT; ch++) {
        uint16_t bit = (uint16_t)(1u << ch);
        if ((g_counter_edge[ch] == 0u && (rose    & bit)) ||
            (g_counter_edge[ch] == 1u && (fell    & bit)) ||
            (g_counter_edge[ch] == 2u && (changed & bit)))
            g_counter[ch]++;
    }
    g_counter_last = now;
}

// COUNTER mode-bank register access (0x10-0x1A), dispatched only while MODE_COUNTER.
// The u32 COUNT / COUNT_RDCLR windows are read as 4 consecutive byte addresses.
// To avoid a torn u32 mid-read, byte 0 (0x11 / 0x15) takes a coherent snapshot of
// the live counter into g_counter_shadow[sel] under a brief TC5-IRQ mask; bytes
// 1..3 just return shadow bytes 1..3. RDCLR additionally zeroes the live counter
// inside the same masked region (read-and-clear, no edges lost — edges between the
// snapshot and the next ISR tick count toward the next read).
static uint8_t counter_reg_read(uint8_t reg) {
    uint8_t sel = (g_counter_ch_sel < COUNTER_CH_COUNT) ? g_counter_ch_sel : 0u;
    switch (reg) {
    case REG_COUNTER_CH_SEL: return g_counter_ch_sel;
    case REG_COUNTER_COUNT0:                                      // snapshot live -> shadow
        NVIC_DisableIRQ(TC5_IRQn);
        g_counter_shadow[sel] = g_counter[sel];
        if (g_counter_tc_initialized) NVIC_EnableIRQ(TC5_IRQn);
        return (uint8_t)g_counter_shadow[sel];
    case 0x12u:              return (uint8_t)(g_counter_shadow[sel] >> 8);
    case 0x13u:              return (uint8_t)(g_counter_shadow[sel] >> 16);
    case REG_COUNTER_COUNT3: return (uint8_t)(g_counter_shadow[sel] >> 24);
    case REG_COUNTER_RDCLR0:                                      // snapshot + atomic clear
        NVIC_DisableIRQ(TC5_IRQn);
        g_counter_shadow[sel] = g_counter[sel];
        g_counter[sel]        = 0u;
        if (g_counter_tc_initialized) NVIC_EnableIRQ(TC5_IRQn);
        return (uint8_t)g_counter_shadow[sel];
    case 0x16u:             return (uint8_t)(g_counter_shadow[sel] >> 8);
    case 0x17u:             return (uint8_t)(g_counter_shadow[sel] >> 16);
    case REG_COUNTER_RDCLR3:return (uint8_t)(g_counter_shadow[sel] >> 24);
    case REG_COUNTER_EDGE:  return g_counter_edge[sel];
    default:                return 0xFFu;                         // CLEAR is write-only
    }
}
static void counter_reg_write(uint8_t reg, uint8_t val) {
    uint8_t sel = (g_counter_ch_sel < COUNTER_CH_COUNT) ? g_counter_ch_sel : 0u;
    switch (reg) {
    case REG_COUNTER_CH_SEL:
        if (val < COUNTER_CH_COUNT) g_counter_ch_sel = val;      // out-of-range clamped (ignored)
        break;
    case REG_COUNTER_EDGE:
        if (val > 2u) val = 2u;                                  // clamp to 0..2
        g_counter_edge[sel] = val;
        break;
    case REG_COUNTER_CLEAR:                                      // 0xFF -> all; else selected
        NVIC_DisableIRQ(TC5_IRQn);
        if (val == 0xFFu) {
            for (uint8_t ch = 0; ch < COUNTER_CH_COUNT; ch++) g_counter[ch] = 0u;
        } else {
            g_counter[sel] = 0u;
        }
        if (g_counter_tc_initialized) NVIC_EnableIRQ(TC5_IRQn);
        break;
    default: break;                                             // read-only / unimplemented ignored
    }
}

// Register read dispatch (control bank). Out-of-range -> 0xFF.
static uint8_t i2c_reg_read(uint8_t reg) {
    if (reg >= 0x10u && reg <= 0x3Fu) {                  // mode bank — interpreted per active mode
        if (g_mode == MODE_PIO) return pio_reg_read(reg);
        if (g_mode == MODE_ADC) return adc_reg_read(reg);
        if (g_mode == MODE_MIXED) return mixed_reg_read(reg);
        if (g_mode == MODE_SERVO) return servo_reg_read(reg);
        if (g_mode == MODE_COUNTER) return counter_reg_read(reg);
        return 0xFFu;
    }
    switch (reg) {
    case 0x00: return I2C_CLIENT_WHOAMI;
    case 0x01: return I2C_CLIENT_VERSION;
    case 0x02: return g_mode;
    case 0x03: return (uint8_t)(g_status | (g_offline ? 0x08u : 0x00u));   // bit3 = OFFLINE
    case 0x04: return g_int_flags;
    case 0x05: return g_i2c_addr;
    case 0x06: case 0x07: case 0x08: case 0x09:
    case 0x0A: case 0x0B: case 0x0C: case 0x0D:
        return g_unique_id[reg - 0x06u];
    // NOTE: this register window is the legacy SLOT-indexed access path (sel =
    // slot 0..STORE_SLOTS-1). A name-based open/read/write interface is a later
    // step in the named-file-filesystem migration.
    case REG_REC_SEL:  return g_store_rec_sel;
    case REG_REC_LEN:  return (g_store_rec_sel < STORE_SLOTS) ? g_rec_len[g_store_rec_sel] : 0u;
    case REG_REC_OFF:  return g_store_rec_off;
    case REG_REC_DATA: {                              // data port: advances OFFSET, not reg ptr
        uint8_t v = 0xFFu;
        if (g_store_rec_sel < STORE_SLOTS && g_store_rec_off < STORE_DATA_MAX)
            v = g_rec_data[g_store_rec_sel][g_store_rec_off];
        if (g_store_rec_off < STORE_DATA_MAX) g_store_rec_off++;
        return v;
    }
    case REG_STORE_STAT: return g_status;
    case REG_SET_ADDR:   return 0u;
    // FILE bank (name-keyed, read-only). FILE_NAME/FILE_DATA are data-ports:
    // they advance their own cursor, not the register pointer (see IS_DATA_PORT).
    case REG_FILE_NAME: {                             // data port: read back the name byte, advance
        uint8_t v = g_file_name[g_file_name_idx];
        g_file_name_idx = (uint8_t)((g_file_name_idx + 1u) & 3u);
        return v;
    }
    case REG_FILE_STAT: return (g_file_slot >= 0) ? 0u : 1u;
    case REG_FILE_SIZE: return (g_file_slot >= 0) ? g_rec_len[g_file_slot] : 0u;
    case REG_FILE_DATA:                               // data port: next file byte, advance cursor
        if (g_file_slot >= 0 && g_file_off < g_rec_len[g_file_slot])
            return g_rec_data[g_file_slot][g_file_off++];
        return 0xFFu;
    default:   return 0xFFu;
    }
}

// LIST helper: advance g_file_list_i to the next USED slot from its current
// value, then publish that slot (or -1 when exhausted) + its name into the
// FILE bank state. `from_start` resets the cursor to slot 0 first.
static void file_list_advance(bool from_start) {
    uint8_t i = from_start ? 0u : (uint8_t)(g_file_list_i + 1u);
    for (; i < STORE_SLOTS; i++) {
        if (g_rec_used[i]) break;
    }
    g_file_list_i = i;
    if (i < STORE_SLOTS) {
        g_file_slot = (int)i;
        memcpy(g_file_name, g_rec_name[i], STORE_NAME_LEN);
    } else {
        g_file_slot = -1;
    }
    g_file_name_idx = 0u;
    g_file_off = 0u;
}

// ============================================================================
// Commissioning lifecycle: mode enter/leave factoring + offline/tri-state.
//
// mode_leave(m) / mode_enter(m) hold the exact per-mode teardown / setup logic
// that used to be inlined in i2c_reg_write case 0x02. They're shared by the
// runtime MODE-register switch, the boot-time "apply commissioned mode" (B4),
// and the offline transition (which leaves the active mode then tri-states).
// ============================================================================

// "leaving m" — undo whatever mode_enter(m) set up. IDLE = no-op.
static void mode_leave(uint8_t m) {
    if (m == MODE_PIO) {                            // leaving PIO
        pio_il_disarm();                            // deassert INT, drop the latch
        pio_safe_all();                             // pins safe (inputs)
        DAC->CTRLB.bit.EOEN = 1;                    // restore DAC output buffer on PA02
        while (DAC->STATUS.bit.SYNCBUSY) { /* spin */ }
    } else if (m == MODE_ADC) {                     // leaving ADC
        NVIC_DisableIRQ(TC3_IRQn);                  // stop the DAC waveform generator
        g_dac_wf.active = false;
        tc3_stop();
    } else if (m == MODE_MIXED) {                   // leaving MIXED
        mixed_il_disarm();                          // deassert INT, drop latch, release pins (safe)
    } else if (m == MODE_SERVO) {                   // leaving SERVO
        servo_exit();                               // stop TC4, drive all servo pins low
        DAC->CTRLB.bit.EOEN = 1;                    // restore DAC output buffer on PA02 (CH0)
        while (DAC->STATUS.bit.SYNCBUSY) { /* spin */ }
    } else if (m == MODE_COUNTER) {                 // leaving COUNTER
        counter_exit();                             // stop TC5 (pins stay inputs, safe)
        DAC->CTRLB.bit.EOEN = 1;                    // restore DAC output buffer on PA02 (CH0)
        while (DAC->STATUS.bit.SYNCBUSY) { /* spin */ }
    }
}

