glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_commands.c
// "entering m" — set up the mode's pins/peripherals. IDLE = no-op.
static void mode_enter(uint8_t m) {
    if (m == MODE_PIO) {                            // entering PIO
        DAC->CTRLB.bit.EOEN = 0;                    // free CH0=PA02 from the DAC (else it pins CH0 low)
        while (DAC->STATUS.bit.SYNCBUSY) { /* spin */ }
        gpmp_apply();                               // load the commissioned power-on pin map
        pio_apply_all();                            // claim + configure the 8 channels
        pio_il_arm();                               // parse interlock_cfg, set up INT pin
    } else if (m == MODE_ADC) {                     // entering ADC
        adc_mode_setup();                           // DIV16 sampler + window stats + DAC const
    } else if (m == MODE_MIXED) {                   // entering MIXED
        mixed_il_arm();                             // parse interlock_cfg, claim pins, set up INT
    } else if (m == MODE_SERVO) {                   // entering SERVO
        DAC->CTRLB.bit.EOEN = 0;                    // free CH0=PA02 from the DAC (else it pins CH0 low)
        while (DAC->STATUS.bit.SYNCBUSY) { /* spin */ }
        servo_enter();                              // pins->GPIO low, build schedule, start TC4
    } else if (m == MODE_COUNTER) {                 // entering COUNTER
        DAC->CTRLB.bit.EOEN = 0;                    // free CH0=PA02 from the DAC so it reads as input
        while (DAC->STATUS.bit.SYNCBUSY) { /* spin */ }
        counter_enter();                            // pins->GPIO inputs, seed last, zero, start TC5
    }
}

// Commissioning offline state. g_offline is declared near g_status (above) so
// the STATUS-register read (case 0x03) can surface it as bit3. false = ONLINE
// (default at boot): serves config, drives commissioned pins, config WRITES
// refused. true = OFFLINE: mode halted, all HIL pins tri-stated, config WRITES
// allowed. OFFLINE->ONLINE only via USB disconnect -> reboot (the cold boot
// re-applies config in i2c_slave_init/B4).
bool samd21_is_offline(void) { return g_offline; }

// True while a deferred config-store flash commit is queued or in flight (the
// i2c_store_service main-loop pump clears g_commit_pending to -1 when done).
// main.c gates the offline-disconnect reboot on this so files finish persisting.
bool samd21_store_commit_pending(void) { return g_commit_pending >= 0; }

// Tri-state the full union of HIL pins (the 9 servo/counter channels, which
// already includes D6/PB08 the INT pin): input, INEN on for read-back, NO pull,
// NO drive => Hi-Z. Then disable the DAC output buffer, stop both mode timers
// (idempotent), deassert INT, and latch g_mode=IDLE / g_offline=true.
void mode_go_offline(void) {
    mode_leave(g_mode);

    // The servo/counter pad table is the union of all 9 driven channel pins and
    // includes D6=PB08 (the INT pin, channel 8 here). Tri-state each.
    for (uint8_t ch = 0; ch < SERVO_CH_COUNT; ch++) {
        uint8_t g = g_servo_pad[ch].group, p = g_servo_pad[ch].pin;
        PORT->Group[g].DIRCLR.reg      = (1u << p);          // input (no drive)
        PORT->Group[g].PINCFG[p].reg   = PORT_PINCFG_INEN;   // INEN on, no pull, no drive => Hi-Z
    }

    DAC->CTRLB.bit.EOEN = 0;                         // release A0/PA02 from the DAC (Hi-Z input)
    while (DAC->STATUS.bit.SYNCBUSY) { /* spin */ }

    servo_tc_stop();                                 // stop TC4 (idempotent)
    counter_tc_stop();                               // stop TC5 (idempotent)

    pio_int_assert(false);                           // deassert INT (D6/PB08)

    g_mode    = MODE_IDLE;
    g_offline = true;
}

// Register write dispatch. Read-only / unimplemented regs are ignored.
static void i2c_reg_write(uint8_t reg, uint8_t val) {
    if (reg >= 0x10u && reg <= 0x3Fu) {                  // mode bank — interpreted per active mode
        if (g_mode == MODE_PIO) pio_reg_write(reg, val);
        else if (g_mode == MODE_ADC) adc_reg_write(reg, val);
        else if (g_mode == MODE_MIXED) mixed_reg_write(reg, val);
        else if (g_mode == MODE_SERVO) servo_reg_write(reg, val);
        else if (g_mode == MODE_COUNTER) counter_reg_write(reg, val);
        return;
    }
    switch (reg) {
    case 0x02:                                            // MODE — apply the switch
        if (val <= MODE_MAX && val != g_mode) {
            mode_leave(g_mode);
            g_mode = val;
            mode_enter(val);
        }
        break;
    case 0x04:                                            // INT_FLAGS: write-1-to-clear
        g_int_flags &= (uint8_t)~val;
        if (val & 0x01u) pio_il_manual_reset();           // acking the trip bit == manual reset
        if ((val & MIXED_IL_INT_BIT) && g_mode == MODE_MIXED) mixed_il_manual_reset();
        break;
    case 0x0E: if (val == 0xA5u) g_reset_pending = true; break;  // RESET (magic 0xA5; deferred)
    // NOTE: SLOT-indexed legacy access path (sel = slot 0..STORE_SLOTS-1). The
    // name-based open/read/write interface is a later migration step.
    case REG_REC_SEL: if (val < STORE_SLOTS) { g_store_rec_sel = val; g_store_rec_off = 0u; } break;
    case REG_REC_LEN: if (g_store_rec_sel < STORE_SLOTS && val <= STORE_DATA_MAX) g_rec_len[g_store_rec_sel] = val; break;
    case REG_REC_OFF: g_store_rec_off = val; break;
    case REG_REC_DATA:                                    // data port: write byte, grow len, advance offset
        if (g_store_rec_sel < STORE_SLOTS && g_store_rec_off < STORE_DATA_MAX) {
            g_rec_data[g_store_rec_sel][g_store_rec_off] = val;
            if ((uint16_t)g_store_rec_off + 1u > g_rec_len[g_store_rec_sel])
                g_rec_len[g_store_rec_sel] = (uint8_t)(g_store_rec_off + 1u);
            g_rec_dirty[g_store_rec_sel] = true;
        }
        if (g_store_rec_off < STORE_DATA_MAX) g_store_rec_off++;
        break;
    case REG_REC_CTRL:                                    // 0xC0 = commit selected, 0x5E = reload all
        if (val == 0xC0u && g_store_rec_sel < STORE_SLOTS && g_rec_used[g_store_rec_sel])
            g_commit_pending = (int8_t)g_store_rec_sel;
        else if (val == 0x5Eu) store_load();
        break;
    case REG_SET_ADDR:                                    // commissioning data-port: [0xAC magic][new_addr]
        if (!g_setaddr_armed) {
            g_setaddr_armed = (val == 0xACu);
        } else {
            g_setaddr_armed = false;
            if (val >= 0x08u && val <= 0x77u) {           // valid 7-bit address
                int s = store_alloc_str("idnt");          // identity named slot
                if (s >= 0) {
                    g_rec_data[s][0] = val;               // identity record byte 0 = I2C address
                    if (g_rec_len[s] < 1u) g_rec_len[s] = 1u;
                    g_rec_dirty[s] = true;
                    g_commit_pending = (int8_t)s;         // persist; effective on next RESET
                }
            }
        }
        break;
    // FILE bank (name-keyed, read-only for the master).
    case REG_FILE_NAME:                                   // data port: burst the 4-byte name in
        g_file_name[g_file_name_idx] = val;
        g_file_name_idx = (uint8_t)((g_file_name_idx + 1u) & 3u);
        break;
    case REG_FILE_CTRL:
        if (val == 0x01u) {                               // OPEN by name
            g_file_slot = store_find(g_file_name);
            g_file_off = 0u; g_file_name_idx = 0u;
        } else if (val == 0x02u) {                        // CLOSE
            g_file_slot = -1;
        } else if (val == 0x03u) {                        // LIST_FIRST
            file_list_advance(true);
        } else if (val == 0x04u) {                        // LIST_NEXT
            file_list_advance(false);
        }
        break;
    case REG_FILE_SEEK: if (val <= STORE_DATA_MAX) g_file_off = val; break;
    default:   break;
    }
}

static void i2c_slave_init(void) {
    i2c_read_unique_id();   // for commissioning identification (UNIQUE_ID regs)
    store_load();           // scan the config log -> RAM shadow of each record

    // Identity record ("idnt"): byte0 = I2C address, byte1 = power-up mode.
    // Default 0x55 / IDLE if unprovisioned. (Set via SET_ADDR commissioning.)
    int idn = store_find_str("idnt");
    if (idn >= 0 && g_rec_len[idn] >= 1u) {
        uint8_t a = g_rec_data[idn][0];
        if (a >= 0x08u && a <= 0x77u) g_i2c_addr = a;
    }
    if (idn >= 0 && g_rec_len[idn] >= 2u) {
        uint8_t m = g_rec_data[idn][1];
        if (m <= MODE_MAX) g_mode = m;
    }

    // B4: actually ENTER the commissioned mode at boot so the SAMD21 drives its
    // pins per the freshly-loaded config (previously g_mode was set lazily and
    // only took effect on the next MODE-register write). IDLE -> no-op.
    if (g_mode <= MODE_MAX) mode_enter(g_mode);

    // 1. Bus clock.
    PM->APBCMASK.reg |= PM_APBCMASK_SERCOM2;

    // 2. SERCOM2 core + slow clocks -> GCLK0 (48 MHz).
    GCLK->CLKCTRL.reg = (uint16_t)(GCLK_CLKCTRL_ID(I2C_GCLK_ID_CORE)
                                 | GCLK_CLKCTRL_GEN_GCLK0 | GCLK_CLKCTRL_CLKEN);
    while (GCLK->STATUS.bit.SYNCBUSY) { /* spin */ }
    GCLK->CLKCTRL.reg = (uint16_t)(GCLK_CLKCTRL_ID(I2C_GCLK_ID_SLOW)
                                 | GCLK_CLKCTRL_GEN_GCLK0 | GCLK_CLKCTRL_CLKEN);
    while (GCLK->STATUS.bit.SYNCBUSY) { /* spin */ }

