glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_commands.c
    // 3. Reset SERCOM2.
    I2C_SERCOM->I2CS.CTRLA.bit.SWRST = 1;
    while (I2C_SERCOM->I2CS.SYNCBUSY.bit.SWRST) { /* spin */ }

    // 4. I2C slave mode, 300 ns SDA hold, SCLSM = stretch SCL after the ACK bit
    //    (gives the ISR time to load the read byte — required for slave transmit).
    I2C_SERCOM->I2CS.CTRLA.reg =
        SERCOM_I2CS_CTRLA_MODE_I2C_SLAVE |
        SERCOM_I2CS_CTRLA_SDAHOLD(2) |
        SERCOM_I2CS_CTRLA_SCLSM;

    // 4b. Smart mode: a DATA access auto-handles the ACK/byte protocol (SCLSM
    //     requires it). This is what makes the transmit actually drive the byte.
    I2C_SERCOM->I2CS.CTRLB.reg = SERCOM_I2CS_CTRLB_SMEN;

    // 5. 7-bit address (placed in ADDR[7:1] by the macro), exact match. From
    //    g_i2c_addr (default 0x55; M2c loads it from the identity record).
    I2C_SERCOM->I2CS.ADDR.reg = SERCOM_I2CS_ADDR_ADDR(g_i2c_addr);

    // 6. PMUX PA08/PA09 -> function D (SERCOM2 PAD[0]/[1]).
    PORT->Group[0].PINCFG[8].bit.PMUXEN = 1;
    PORT->Group[0].PMUX[4].bit.PMUXE    = PORT_PMUX_PMUXE_D_Val;
    PORT->Group[0].PINCFG[9].bit.PMUXEN = 1;
    PORT->Group[0].PMUX[4].bit.PMUXO    = PORT_PMUX_PMUXO_D_Val;

    // 7. Interrupts: address match, data ready, stop received.
    I2C_SERCOM->I2CS.INTENSET.reg =
        SERCOM_I2CS_INTENSET_AMATCH |
        SERCOM_I2CS_INTENSET_DRDY |
        SERCOM_I2CS_INTENSET_PREC;
    NVIC_EnableIRQ(SERCOM2_IRQn);

    // 8. Enable.
    I2C_SERCOM->I2CS.CTRLA.bit.ENABLE = 1;
    while (I2C_SERCOM->I2CS.SYNCBUSY.bit.ENABLE) { /* spin */ }
}

void SERCOM2_Handler(void) {
    SercomI2cs *s = &I2C_SERCOM->I2CS;

    // Stop received -> end of transaction; next AMATCH starts fresh.
    if (s->INTFLAG.bit.PREC) {
        s->INTFLAG.reg = SERCOM_I2CS_INTFLAG_PREC;
        i2c_reg_ptr_known = false;
        return;
    }

    // Address match -> ACK (CMD=0x3 also clears AMATCH).
    if (s->INTFLAG.bit.AMATCH) {
        i2c_reg_ptr_known = false;
        if (s->STATUS.bit.DIR) {                        // master read -> pre-load 1st tx byte
            s->DATA.reg = i2c_reg_read(i2c_reg_ptr);    // else the stale addr byte goes out first
            if (!IS_DATA_PORT(i2c_reg_ptr)) i2c_reg_ptr++;  // data port advances OFFSET, not reg ptr
        }
        s->CTRLB.bit.ACKACT = 0;
        s->CTRLB.bit.CMD = 0x3;                         // ACK the address (smart mode)
        return;
    }

    // Data ready.
    if (s->INTFLAG.bit.DRDY) {
        if (s->STATUS.bit.DIR) {                        // master read -> slave transmit
            s->DATA.reg = i2c_reg_read(i2c_reg_ptr);    // smart mode sends it
            if (!IS_DATA_PORT(i2c_reg_ptr)) i2c_reg_ptr++;
        } else {                                        // master write -> slave receive
            uint8_t b = (uint8_t)s->DATA.reg;           // smart mode ACKs it
            if (!i2c_reg_ptr_known) { i2c_reg_ptr = b; i2c_reg_ptr_known = true; }
            else { uint8_t reg = i2c_reg_ptr; i2c_reg_write(reg, b); if (!IS_DATA_PORT(reg)) i2c_reg_ptr++; }
        }
        return;
    }
}

// ============================================================================
// USB-CDC chunked config-file write — the Pi host stages a named config file
// into the name-keyed store over the shell, then commits it to flash.
//
// A file larger than ~120 B can't fit one COMM_PAYLOAD_MAX (128 B) shell frame,
// so the host streams it: BEGIN (open a slot by name) -> one or more DATA chunks
// (appended into the per-slot RAM shadow g_rec_data[slot]) -> COMMIT (publish
// g_rec_len + dirty, then hand the slot to the async i2c_store_service via
// g_commit_pending, which does the deferred flash write). The command returns
// immediately; nothing persists without COMMIT. Re-writing a name updates it
// (store_alloc returns the existing slot; commit appends a higher-seq entry).
// DELETE is intentionally out of scope.
// ============================================================================
static int      g_file_wr_slot = -1;   // slot being staged, -1 = no open BEGIN
static uint16_t g_file_wr_len;          // bytes appended into the shadow so far

// ---------- CMD_FILE_BEGIN -----------------------------------------------
// args:   name[4]   result: empty   status: OK / BAD_ARGS (store full / short)
static uint8_t cmd_file_begin(shell_reader_t* args, shell_writer_t* result) {
    (void)result;
    if (!g_offline) return SHELL_STATUS_BUSY;   // online: not accepting commissioning writes
    if (sr_remaining(args) < STORE_NAME_LEN) return SHELL_STATUS_BAD_ARGS;
    uint8_t name[STORE_NAME_LEN];
    sr_bytes(args, name, STORE_NAME_LEN);
    if (args->overflow || sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;

    int s = store_alloc(name);
    if (s < 0) return SHELL_STATUS_CMD_FAILED;   // store full (16 slots used)
    g_file_wr_slot = s;
    g_file_wr_len  = 0;
    return SHELL_STATUS_OK;
}

// ---------- CMD_FILE_DATA ------------------------------------------------
// args:   chunk bytes   result: empty   status: OK / BAD_ARGS
// Appends the chunk into the open slot's shadow; rejects if it would overflow
// STORE_DATA_MAX (240) or if no BEGIN is open.
static uint8_t cmd_file_data(shell_reader_t* args, shell_writer_t* result) {
    (void)result;
    if (!g_offline) return SHELL_STATUS_BUSY;   // online: not accepting commissioning writes
    if (g_file_wr_slot < 0) return SHELL_STATUS_BAD_ARGS;   // no BEGIN
    uint16_t n = sr_remaining(args);
    if ((uint32_t)g_file_wr_len + n > STORE_DATA_MAX) return SHELL_STATUS_BAD_ARGS;
    sr_bytes(args, &g_rec_data[g_file_wr_slot][g_file_wr_len], n);
    if (args->overflow) return SHELL_STATUS_BAD_ARGS;
    g_file_wr_len = (uint16_t)(g_file_wr_len + n);
    return SHELL_STATUS_OK;
}

// ---------- CMD_FILE_COMMIT ----------------------------------------------
// args:   (none)   result: empty   status: OK / BAD_ARGS
// Publishes the staged length, marks dirty, and queues the flash commit for
// i2c_store_service (main loop). Returns immediately; the write is deferred.
static uint8_t cmd_file_commit(shell_reader_t* args, shell_writer_t* result) {
    (void)result;
    if (!g_offline) return SHELL_STATUS_BUSY;   // online: not accepting commissioning writes
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    if (g_file_wr_slot < 0)      return SHELL_STATUS_BAD_ARGS;   // no BEGIN
    g_rec_len[g_file_wr_slot]   = (uint8_t)g_file_wr_len;
    g_rec_dirty[g_file_wr_slot] = true;
    g_commit_pending            = (int8_t)g_file_wr_slot;
    g_file_wr_slot = -1;
    return SHELL_STATUS_OK;
}

// ---------- CMD_FILE_LIST ------------------------------------------------
// args:   (none)
// result: count:u8 then per used slot {name[4], len:u8}  (<=16*5 = 80 B)
static uint8_t cmd_file_list(shell_reader_t* args, shell_writer_t* result) {
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    uint8_t count = 0;
    for (uint8_t i = 0; i < STORE_SLOTS; i++) if (g_rec_used[i]) count++;
    sw_u8(result, count);
    for (uint8_t i = 0; i < STORE_SLOTS; i++) {
        if (!g_rec_used[i]) continue;
        sw_bytes(result, g_rec_name[i], STORE_NAME_LEN);
        sw_u8(result, g_rec_len[i]);
    }
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

// ---------- CMD_REG_READ / CMD_REG_WRITE / CMD_REG_READN -----------------
// USB->I2C-register bridge: proxy the SAME i2c_reg_read/i2c_reg_write the I2C
// slave ISR uses, so a Python host on ttyACM can drive every mode bank + the
// FILE/store windows over USB and exercise the identical register code the Pico
// runs over I2C. READN mirrors an I2C burst read: a data-port reg streams (its
// cursor advances internally, register held), any other reg auto-advances the
// address. Intended for a USB-only test harness — do not drive concurrently with
// live I2C-master traffic on the same registers.
static uint8_t cmd_reg_read(shell_reader_t* args, shell_writer_t* result) {
    if (sr_remaining(args) < 1u) return SHELL_STATUS_BAD_ARGS;
    sw_u8(result, i2c_reg_read(sr_u8(args)));
    return SHELL_STATUS_OK;
}
static uint8_t cmd_reg_write(shell_reader_t* args, shell_writer_t* result) {
    (void)result;
    if (sr_remaining(args) < 2u) return SHELL_STATUS_BAD_ARGS;
    uint8_t reg = sr_u8(args);
    i2c_reg_write(reg, sr_u8(args));
    return SHELL_STATUS_OK;
}
static uint8_t cmd_reg_readn(shell_reader_t* args, shell_writer_t* result) {
    if (sr_remaining(args) < 2u) return SHELL_STATUS_BAD_ARGS;
    uint8_t reg = sr_u8(args);
    uint8_t n   = sr_u8(args);
    for (uint8_t i = 0; i < n; i++) {
        sw_u8(result, i2c_reg_read(reg));
        if (!IS_DATA_PORT(reg)) reg++;          // mirror the I2C register-pointer auto-advance
    }
    return result->overflow ? SHELL_STATUS_RESULT_TOO_BIG : SHELL_STATUS_OK;
}

