glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_commands.c
// ---------- CMD_OFFLINE --------------------------------------------------
// args: (none)   result: empty   status: OK
// Enter the commissioning OFFLINE state: halt the active mode, tri-state every
// HIL pin (Hi-Z), release the DAC + stop the mode timers, deassert INT, and
// begin accepting config-file writes. Return to ONLINE only via USB disconnect
// -> reboot (the cold boot re-applies the freshly-written config; see B4).
static uint8_t cmd_offline(shell_reader_t* args, shell_writer_t* result) {
    (void)result;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    mode_go_offline();
    return SHELL_STATUS_OK;
}
#endif // I2C_CLIENT

// --- low-level helpers --------------------------------------------------

// Wait for either MB (master TX done) or SB (slave reply ready). No timeout
// in v1; relies on layer-2 WDT to catch a wedged bus.
static void i2c_wait_complete(void) {
    while (!(I2C_SERCOM->I2CM.INTFLAG.reg
            & (SERCOM_I2CM_INTFLAG_MB | SERCOM_I2CM_INTFLAG_SB))) { /* spin */ }
}

// Returns true on bus-level failure (BUSERR or ARBLOST). RXNACK is checked
// separately by callers because it's a "remote replied" condition vs a
// "wire broke" condition.
static bool i2c_bus_error(void) {
    return (I2C_SERCOM->I2CM.STATUS.bit.BUSERR != 0)
        || (I2C_SERCOM->I2CM.STATUS.bit.ARBLOST != 0);
}

static void i2c_stop(void) {
    I2C_SERCOM->I2CM.CTRLB.bit.CMD = 3;  // STOP
    while (I2C_SERCOM->I2CM.SYNCBUSY.bit.SYSOP) { /* spin */ }
}

// START + addr, write or read direction. Returns true if address ACKed.
// On NACK or bus error, leaves the bus in an indeterminate state; caller
// must issue STOP to recover (i2c_stop()).
static bool i2c_start(uint8_t addr, bool read) {
    I2C_SERCOM->I2CM.ADDR.reg = ((uint32_t)addr << 1) | (read ? 1u : 0u);
    i2c_wait_complete();
    if (i2c_bus_error()) return false;
    return (I2C_SERCOM->I2CM.STATUS.bit.RXNACK == 0);
}

// Write one byte. Returns true if ACKed.
static bool i2c_write_byte(uint8_t data) {
    I2C_SERCOM->I2CM.DATA.reg = data;
    i2c_wait_complete();
    if (i2c_bus_error()) return false;
    return (I2C_SERCOM->I2CM.STATUS.bit.RXNACK == 0);
}

// Read one byte. If is_last, the next-byte ACK is set to NACK (signals
// the slave we're done). Caller should follow last-byte read with i2c_stop().
static uint8_t i2c_read_byte(bool is_last) {
    // ACKACT must be set BEFORE reading DATA (reading DATA triggers next byte).
    I2C_SERCOM->I2CM.CTRLB.bit.ACKACT = is_last ? 1 : 0;
    while (I2C_SERCOM->I2CM.SYNCBUSY.bit.SYSOP) { /* spin */ }
    uint8_t data = (uint8_t)I2C_SERCOM->I2CM.DATA.reg;
    if (!is_last) {
        // Trigger next byte read (CMD=2 = read).
        I2C_SERCOM->I2CM.CTRLB.bit.CMD = 2;
        while (I2C_SERCOM->I2CM.SYNCBUSY.bit.SYSOP) { /* spin */ }
        i2c_wait_complete();
    }
    return data;
}

// --- shell commands ----------------------------------------------------

#define I2C_MAX_WRITE_LEN  32u  // fits within shell args + leaves frame headroom
#define I2C_MAX_READ_LEN   60u  // fits within shell result_message budget

// CMD_I2C_WRITE: addr:u8 (7-bit), data:u8[1..32]
// Sequence: START + addr(W) + data... + STOP. NACK at any byte → STOP + BAD_ARGS.
static uint8_t cmd_i2c_write(shell_reader_t* args, shell_writer_t* result) {
    (void)result;
    uint8_t addr = sr_u8(args);
    if (args->overflow)             return SHELL_STATUS_BAD_ARGS;
    if (addr > 0x7Fu)               return SHELL_STATUS_BAD_ARGS;
    uint16_t n = sr_remaining(args);
    if (n == 0u || n > I2C_MAX_WRITE_LEN) return SHELL_STATUS_BAD_ARGS;

    if (!i2c_start(addr, false)) { i2c_stop(); return SHELL_STATUS_BAD_ARGS; }
    for (uint16_t i = 0; i < n; i++) {
        uint8_t b = sr_u8(args);
        if (!i2c_write_byte(b)) { i2c_stop(); return SHELL_STATUS_BAD_ARGS; }
    }
    i2c_stop();
    return SHELL_STATUS_OK;
}

// CMD_I2C_READ: addr:u8, count:u8 (1..60)
// Sequence: START + addr(R) + read count bytes + STOP.
// Returns bytes read on success.
static uint8_t cmd_i2c_read(shell_reader_t* args, shell_writer_t* result) {
    uint8_t addr  = sr_u8(args);
    uint8_t count = sr_u8(args);
    if (args->overflow)            return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != 0)   return SHELL_STATUS_BAD_ARGS;
    if (addr > 0x7Fu)              return SHELL_STATUS_BAD_ARGS;
    if (count == 0u || count > I2C_MAX_READ_LEN) return SHELL_STATUS_BAD_ARGS;

    if (!i2c_start(addr, true)) { i2c_stop(); return SHELL_STATUS_BAD_ARGS; }
    for (uint8_t i = 0; i < count; i++) {
        uint8_t b = i2c_read_byte(i == (count - 1u));
        sw_u8(result, b);
        if (result->overflow) { i2c_stop(); return SHELL_STATUS_RESULT_TOO_BIG; }
    }
    i2c_stop();
    return SHELL_STATUS_OK;
}

// CMD_I2C_WRITE_READ: addr:u8, write_count:u8, read_count:u8, write_data:u8[write_count]
// Sequence: START + addr(W) + write_data + repeated-START + addr(R) + read read_count + STOP.
// The canonical sensor pattern: "set register pointer, then read N bytes".
static uint8_t cmd_i2c_write_read(shell_reader_t* args, shell_writer_t* result) {
    uint8_t addr        = sr_u8(args);
    uint8_t write_count = sr_u8(args);
    uint8_t read_count  = sr_u8(args);
    if (args->overflow)             return SHELL_STATUS_BAD_ARGS;
    if (addr > 0x7Fu)               return SHELL_STATUS_BAD_ARGS;
    if (write_count == 0u || write_count > I2C_MAX_WRITE_LEN) return SHELL_STATUS_BAD_ARGS;
    if (read_count  == 0u || read_count  > I2C_MAX_READ_LEN)  return SHELL_STATUS_BAD_ARGS;
    if (sr_remaining(args) != write_count) return SHELL_STATUS_BAD_ARGS;

    // Write phase
    if (!i2c_start(addr, false)) { i2c_stop(); return SHELL_STATUS_BAD_ARGS; }
    for (uint8_t i = 0; i < write_count; i++) {
        uint8_t b = sr_u8(args);
        if (!i2c_write_byte(b)) { i2c_stop(); return SHELL_STATUS_BAD_ARGS; }
    }
    // Repeated START to switch to read phase (no STOP between).
    if (!i2c_start(addr, true)) { i2c_stop(); return SHELL_STATUS_BAD_ARGS; }
    for (uint8_t i = 0; i < read_count; i++) {
        uint8_t b = i2c_read_byte(i == (read_count - 1u));
        sw_u8(result, b);
        if (result->overflow) { i2c_stop(); return SHELL_STATUS_RESULT_TOO_BIG; }
    }
    i2c_stop();
    return SHELL_STATUS_OK;
}

// CMD_I2C_SCAN: no args. Probes 0x08..0x77 with a zero-byte write.
// Returns: addresses:u8[N] (only addresses that ACKed).
static uint8_t cmd_i2c_scan(shell_reader_t* args, shell_writer_t* result) {
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    for (uint8_t addr = 0x08u; addr <= 0x77u; addr++) {
        bool acked = i2c_start(addr, false);
        i2c_stop();
        if (acked) {
            sw_u8(result, addr);
            if (result->overflow) return SHELL_STATUS_RESULT_TOO_BIG;
        }
    }
    return SHELL_STATUS_OK;
}

// ---------- CMD_TEST_HANG -------------------------------------------------
// Layer-2 WDT bench probe. Disables IRQs and spins; the layer-2 WDT bites
// after ~4 s and the chip resets. Never returns a reply frame.
static uint8_t cmd_test_hang(shell_reader_t* args, shell_writer_t* result) {
    (void)args; (void)result;
    __disable_irq();
    for (;;) { __NOP(); }
    return SHELL_STATUS_OK;  // unreachable
}

// ---------- Interlock framework (slice 1) ---------------------------------
#include "samd21_interlocks.h"

static uint8_t cmd_interlock_status(shell_reader_t* args, shell_writer_t* result) {
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    // v2 status: [ver][nslots] + per-slot {state,id,bc,tf,name[16]} + crash. The
    // exact same bytes the slave pushes as its buffer-2 interlock message, so the
    // Pi has ONE parser whether it pulls (here) or receives the async push.
    uint8_t buf[64];
    uint16_t n = interlock_build_status_v2(buf);
    sw_bytes(result, buf, n);
    if (result->overflow) return SHELL_STATUS_RESULT_TOO_BIG;
    return SHELL_STATUS_OK;
}

// 7b piece 3 — the dumb-slave re-push: just flag the request; the slave poll loop
// re-emits buffer 2 on the next poll. No state, no decisions — the Pi owns those.
static uint8_t cmd_interlock_repush(shell_reader_t* args, shell_writer_t* result) {
    (void)result;
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    interlock_request_repush();
    return SHELL_STATUS_OK;
}

static uint8_t cmd_interlock_set(shell_reader_t* args, shell_writer_t* result) {
    uint8_t slot = sr_u8(args);
    if (args->overflow) return SHELL_STATUS_BAD_ARGS;
    uint16_t text_len = sr_remaining(args);
    if (text_len == 0) return SHELL_STATUS_BAD_ARGS;
    const char* text = (const char*)args->p;
    uint8_t err_payload[3] = {0, 0, 0};
    uint8_t st = interlock_set_slot_dsl(slot, text, text_len, err_payload);
    if (st == SHELL_STATUS_BAD_ARGS) {
        sw_u8(result, err_payload[0]);
        sw_u8(result, err_payload[1]);
        sw_u8(result, err_payload[2]);
        if (result->overflow) return SHELL_STATUS_RESULT_TOO_BIG;
    } else if (st == SHELL_STATUS_BUSY) {
        // payload[0]: 0xFF = pin claim conflict, 0 = slot already armed.
        // payload[1] (claim-conflict only): hal_pin_claim_status_t sub-reason
        // (3=TAKEN, 6=VALUE_MISMATCH, 2=RESERVED, ...). Slot-already-armed
        // path leaves [1]=0 which the host renders as the generic message.
        sw_u8(result, err_payload[0]);
        sw_u8(result, err_payload[1]);
        if (result->overflow) return SHELL_STATUS_RESULT_TOO_BIG;
    }
    return st;
}

static uint8_t cmd_interlock_arm_noop(shell_reader_t* args, shell_writer_t* result) {
    uint8_t slot = sr_u8(args);
    if (args->overflow || sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    (void)result;
    return interlock_arm_slot_noop(slot);
}

static uint8_t cmd_interlock_disarm(shell_reader_t* args, shell_writer_t* result) {
    uint8_t slot = sr_u8(args);
    if (args->overflow || sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    (void)result;
    return interlock_disarm_slot(slot);
}

// Slice-4 stack hardening: surface the runtime stack budget + peak depth.
static uint8_t cmd_stack_hwm(shell_reader_t* args, shell_writer_t* result) {
    if (sr_remaining(args) != 0) return SHELL_STATUS_BAD_ARGS;
    extern volatile uint16_t g_stack_hwm_bytes;
    extern volatile uint16_t g_stack_size_bytes;
    extern volatile uint8_t  g_stack_canary_tripped;
    sw_u16(result, g_stack_hwm_bytes);
    sw_u16(result, g_stack_size_bytes);
    sw_u8 (result, g_stack_canary_tripped);
    if (result->overflow) return SHELL_STATUS_RESULT_TOO_BIG;
    return SHELL_STATUS_OK;
}

// ---------- chip-specific dispatch table ---------------------------------

