glenn-edgar/motioncore-slowbus/app/samd21_client/samd21_commands.c
// Chip-specific command surface. The bus_controller is "nothing but a bus
// manager" — it exposes ONLY the RS-485 transport commands + the stack-HWM
// diagnostic. All HIL (GPIO/DAC/ADC/I2C), the interlock command set, and the
// WDT-hang probe are stripped from the bus_controller build. (The interlock
// *framework* in main.c still compiles for now; removing that for text savings
// is a separate lean-build follow-up.) The slave keeps the full HIL surface so
// the workbench runs on it over the bus.
static const shell_cmd_entry_t g_chip_commands[] = {
#if !defined(ROLE_BUS_CONTROLLER)
    { CMD_GPIO_CONFIG, "gpio_config", cmd_gpio_config },
    { CMD_GPIO_WRITE,  "gpio_write",  cmd_gpio_write  },
    { CMD_GPIO_READ,   "gpio_read",   cmd_gpio_read   },
    { CMD_DAC_WRITE,           "dac_write",          cmd_dac_write          },
    { CMD_ADC_READ,            "adc_read",           cmd_adc_read           },
    { CMD_DAC_WAVEFORM_WRITE,  "dac_waveform_write", cmd_dac_waveform_write },
    { CMD_DAC_STOP,            "dac_stop",           cmd_dac_stop           },
    { CMD_DAC_FOLLOW_START,    "dac_follow_start",   cmd_dac_follow_start   },
    { CMD_DAC_FOLLOW_STOP,     "dac_follow_stop",    cmd_dac_follow_stop    },
    { CMD_ADC_CAPTURE,         "adc_capture",        cmd_adc_capture        },
    { CMD_I2C_WRITE,           "i2c_write",          cmd_i2c_write          },
    { CMD_I2C_READ,            "i2c_read",           cmd_i2c_read           },
    { CMD_I2C_WRITE_READ,      "i2c_write_read",     cmd_i2c_write_read     },
    { CMD_I2C_SCAN,            "i2c_scan",           cmd_i2c_scan           },
#ifdef I2C_CLIENT
    { CMD_FILE_BEGIN,          "file_begin",         cmd_file_begin         },
    { CMD_FILE_DATA,           "file_data",          cmd_file_data          },
    { CMD_FILE_COMMIT,         "file_commit",        cmd_file_commit        },
    { CMD_FILE_LIST,           "file_list",          cmd_file_list          },
    { CMD_REG_READ,            "reg_read",           cmd_reg_read           },
    { CMD_REG_WRITE,           "reg_write",          cmd_reg_write          },
    { CMD_REG_READN,           "reg_readn",          cmd_reg_readn          },
    { CMD_OFFLINE,             "offline",            cmd_offline            },
#endif
#endif
#if !defined(ROLE_BUS_CONTROLLER)
    { CMD_TEST_HANG,           "test_hang",          cmd_test_hang          },
    { CMD_INTERLOCK_STATUS,    "interlock_status",   cmd_interlock_status   },
    { CMD_INTERLOCK_ARM_NOOP,  "interlock_arm_noop", cmd_interlock_arm_noop },
    { CMD_INTERLOCK_DISARM,    "interlock_disarm",   cmd_interlock_disarm   },
    { CMD_INTERLOCK_SET,       "interlock_set",      cmd_interlock_set      },
    { CMD_INTERLOCK_REPUSH,    "interlock_repush",   cmd_interlock_repush   },
#endif
    { CMD_STACK_HWM,           "stack_hwm",          cmd_stack_hwm          },
};

const shell_cmd_entry_t* chip_commands_table(void) {
    return g_chip_commands;
}

uint8_t chip_commands_count(void) {
    return (uint8_t)(sizeof(g_chip_commands) / sizeof(g_chip_commands[0]));
}

// ============================================================================
// samd21_peripherals_init — boot-time init of statically-allocated peripherals.
// Called once from main() after hal_wdt_init(). DAC + ADC are always-on; their
// pins (PA02 for DAC) are locked out from GPIO commands via pin_is_reserved.
// I2C (SERCOM2) and RS-485 (SERCOM4) will hook in here in later commits.
// ============================================================================
void samd21_peripherals_init(void) {
    dac_init();
    adc_init();
#ifdef I2C_CLIENT
    i2c_slave_init();   // SERCOM2 = I2C slave to the Pico master (D4/D5)
#else
    i2c_init();         // SERCOM2 = I2C master for the dongle's own devices
#endif
}
